J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
/*
 * Copyright (c) 2020-2022 EnduroSat AD. All rights reserved.
 *
 * Contents and presentations are protected world-wide.
 * Any kind of using, copying etc. is prohibited without prior permission.
 */
/**
 * @addtogroup es_sxband
 * @{
 *
 * @file     S_X_Band_Trnsm.c
 * @brief    S/X Band transmitter commands implementation
 *
 * @}
 *
 */

#include "es_cdef.h"
#include "S_X_Band_Trnsm.h"
#include "es_crc32.h"
#include "stm32h7xx_it.h"
#include "fm_mng.h"
#include "file_helper.h"
#include "taskmon.h"
#include "es_exeh.h" /* Include DTC error handling */
#include "payload_shared_types.h"
#include "eps_ctrl.h"
#include "eps_ctrl_cfg.h"
#include "assertions.h"
#include "FileSink.h"
#include "crypto.h"
#include "timer.h"
#include "taskmon_stat.h"
#include "datacache.h"
#include "fdir_srv.h"
#include "fdir_srv_log.h"

#include <ctype.h>
#include <string.h>

/*
*********************************************************************************************
* INTERNAL DEFINES
*********************************************************************************************
*/
#define S_X_BAND_TRNSM_TX_RETRY              (10)                                                             /**< Number of times to retry any packet */
#define S_X_BAND_TRNSM_CMD_RETRY             (6)                                                              /**< Number of times to retry a whole request/Command */
#define S_X_BAND_TRNSM_DELALL_CMD_RETRY      (150)                                                            /**< Number of times to retry for the Delete All Files command */
#define S_X_BAND_TRNSM_HEADER                (0x50555345)                                                     /**< Header of every packet */
#define S_X_BAND_TRNSM_READ_FILE_CHUNCK_SIZE (1472)                                                           /**< Size of data read by one packet */
#define S_X_BAND_TRNSM_MAX_READ_BUFFER       (S_X_BAND_TRNSM_READ_FILE_CHUNCK_SIZE + S_X_BAND_TRNSM_TX_RETRY) /**< Maximum size of read data */
#define S_X_BAND_TRNSM_DEFAULT_BAUDRATE      (4)                                                              /**< Default speed of the USART that is connected to the S-band transmitter */
#define S_X_BAND_STACK_SIZE                  (3)                                                              /**< X-Band stack size */
#define S_X_BAND_STACK_DELAY                 (2)                                                              /**< Default X-Band stack delay between protocol states (in ms) - this gets overridden for certain commands */
#define SBAND_OPEN_FILE_DELAY_MS             (3)                                                              /**< GetResult delay for OpenFile command on SBand modules */
#define XBAND_OPEN_FILE_DELAY_MS             (1)                                                              /**< GetResult delay for OpenFile command on XBand modules */
#define SBAND_DEL_FILE_DELAY_MS              (100)                                                            /**< GetResult delay for DelFile command on SBand modules */
#define XBAND_DEL_FILE_DELAY_MS              (100)                                                            /**< GetResult delay for DelFile command on XBand modules */

#define S_X_BAND_CMD_RESP_DELAY   (20) /**< X-Band stack delay - time enough to guarantee the CMD response has been received (ms)*/
#define S_X_BAND_GET_RESULT_DELAY (20) /**< X-Band stack delay - time enough to guarantee the GET_RESULT response has been received (ms)*/
#define S_X_BAND_PACK_SIZE        (16) /**< X-Band packet size in bytes */
#define BITS_IN_1_BYTE            (8)  /**< number of bits in 1 byte; used to avoid magic numbers in the code */
/** Retry condition */
#define S_X_BAND_STACK_RETR_COND(stat) (S_X_BAND_TRNSM_STAT_BUSY == (stat) || S_X_BAND_TRNSM_STAT_NACK == (stat))
/** Explicit macro for protocol retries reduction on condition */
#define S_X_BAND_STACK_RETR_SUB(condition, stackEntry) \
    if ((condition) && ((stackEntry)->retries > 0U))   \
    (stackEntry)->retries--
#define DECR_IF_NONZERO(var) \
    if ((var) > 0U)          \
    (var)--

/** X-Band stack safety enabled or not */
#define S_X_BAND_STACK_SAFETY (1)

#define S_X_BAND_TASK_DMA_FLAG (0x10)

#define TX_CMD_TIMEOUT_MS        (60000U) /**< maximum timeout for the TX mode command in milliseconds */
#define DEL_CMD_TIMEOUT_MS       (60000U) /**< maximum timeout for the Delete/DeleteAll commands in milliseconds */
#define CMD_AVG_TIMEOUT_MS       (5000U)  /**< average worst-case timeout which should work for most commands */
#define FILE_CMD_TIMEOUT_MIN_MS  (1000.)  /**< minimum timeout in milliseconds for file operations */
#define WORST_BYTES_PER_SEC_RATE (5000)   /**< OBC-to-SXBand upload Bps rate calculated with 20% margin on 250K physical bps link + streaming encryption overhead */

#define UNBLOCK_CACHE_THREAD_FLAG (0x02) /**< Event flag value used to unblock the cache update calling thread when the operation is finished */

#define INVALID_SETTING_VALUE_1B      (0xFF)   /**< Invalid setting value used for 1-byte module cache items */
#define INVALID_SETTING_VALUE_2B      (0xFFFF) /**< Invalid setting value used for 2-byte module cache items */
#define TRNSM_ENC_OVERHEAD_PERCENTAGE (36)     /**< Value in percent (%) of transmission-specific overhead such as zero packets, 8B/10B encoding and 2 intermittent comma characters for each 184 byte-packets */

#define STR_INVALID_DATA_PTR "Invalid data pointer"
#define STR_INVALID_DATA_LEN "Ivalid data length"
#define STR_STACK_TIMEOUT    "Stack timeout"
#define STR_TXBUF_LOW        "Transmit buffer is insufficient"
#define STR_UART_RESERVED    "Could not reserve USART interface"

static uint8_t               file_tmp_buf[FILE_TEMP_BUFFER_SIZE];
static fm_file_obj_t         fhnd;
static file_stream_fmt_ctx_t fstream_ctx = {
    .p_data_buf      = file_tmp_buf,
    .data_buf_size   = sizeof(file_tmp_buf),
    .fop_status_last = FM_RES_OK,
    .file_name       = SX_BAND_FOUTPUT_NAME,
    .p_fhnd          = &fhnd
};

static void USER_START_MULTI_BUF_SEQ(sUserResponseCtx_t *const pUserRespCtx)
{
    start_multi_buf_seq(pUserRespCtx);
    fstart_multi_buf_seq(&fstream_ctx);
}

static void USER_COMMIT_MULTI_BUF_SEQ(sUserResponseCtx_t *const pUserRespCtx)
{
    fcommit_multi_buf_seq(&fstream_ctx);
    commit_multi_buf_seq(pUserRespCtx);
}

#define USER_APPEND_FORMATTED_BUF(pUserRespCtx, format, ...)                    \
    do                                                                          \
    {                                                                           \
        append_formatted_buf((pUserRespCtx), (format)OPT_VA_ARGS(__VA_ARGS__)); \
        fappend_formatted_buf(&fstream_ctx, (format)OPT_VA_ARGS(__VA_ARGS__));  \
    } while (0)

