J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
#define USER_COMMIT_FORMATTED_BUF(pUserRespCtx, format, ...)                    \
    do                                                                          \
    {                                                                           \
        commit_formatted_buf((pUserRespCtx), (format)OPT_VA_ARGS(__VA_ARGS__)); \
        fcommit_formatted_buf(&fstream_ctx, (format)OPT_VA_ARGS(__VA_ARGS__));  \
    } while (0)

/*
*********************************************************************************************
* INTERNAL TYPES DEFINITION
*********************************************************************************************
*/
/*
 * Protocol stack machine-related
 */
/** Commands NB states */
typedef enum S_X_BAND_TRNSM_CMD_State
{
    S_X_BAND_TRNSM_CMD_STATE_EMPTY = 0x00,
    S_X_BAND_TRNSM_CMD_STATE_CMD,
    S_X_BAND_TRNSM_CMD_STATE_CMD_RES,
    S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT,
    S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES,
    S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED
} S_X_BAND_TRNSM_CMD_State;

/** Stack node/entry structure */
typedef struct X_BAND_CMD_StackEntry
{
    uint16_t                      devID;
    S_X_BAND_TRNSM_CMD_State      state;
    S_X_BAND_TRNSM_GW_CMD_ID_enum ESTTC_request;
    uint8_t                       ESTTC_request_type;
    uint8_t                       ESTTC_data_size;
    __ALIGN_BEGIN uint8_t         ESTTC_data[S_X_BAND_TRNSM_RX_BUFF_SIZE] __ALIGN_END;
    // this field contains the full path name of a file as it is on the OBC SD card (including folders);
    // it cannot be used with SXBand modules because they do not support folders on the file system (hence the name sent to the
    // module is only the file name part for file operations)
    char                          obc_file_name[FM_MAX_PATH];
    S_X_BAND_TRNSM_CMD_enum       command;
    bool                          isFileCommand;
    uint16_t                      type;
    S_X_BAND_TRNSM_Response_enum  response;
    S_X_BAND_TRNSM_RetRes_enum    result;
    uint32_t                      fileHandler, fileSize;
    uint32_t                      timestamp, minDelay;
    int16_t                       retries;
    uint8_t                       expectSlaveCommand;
    sUserResponseCtx_t           *pUserRespCtx;
    struct X_BAND_CMD_StackEntry *parentEntry;
} S_X_BAND_CMD_StackEntry;

/** Callbacks type */
typedef uint8_t (*S_X_BAND_TRNSM_CMD_callbacks_t)(S_X_BAND_CMD_StackEntry *);

typedef enum
{
    SX_SELECT_S_BAND_TRANSCEIVER,
    SX_SELECT_X_BAND_TRANSCEIVER,
    SX_SELECT_NONE,
    SX_SELECT_NUMBER
} S_X_BAND_Selection_Enum;

typedef enum
{
    CMD_EXTRACT_RESULT_UNSUP_CMD,
    CMD_EXTRACT_RESULT_VALID_CMD
} S_X_BAND_CMD_EXTRACT_RES;

typedef struct
{
    bool          in_progress          : 1; /**< true: dir list enumeration is in progress; false - otherwise */
    bool          file_cache_valid     : 1; /**< true: cache file is up to date; false: cache file content is out of date */
    bool          settings_cache_valid : 1; /**< true: ModCod and SymRate settings cache is valid; false: settings cache is not up to date */
    fm_file_obj_t fhnd;                     /**< File handle for the cached SXBand file data */
    uint8_t       sym_rate;                 /**< Symbol rate setting in MSym/s for SXBand module */
    uint8_t       modcod;                   /**< Modulation Code index setting for SXBand module */
    uint16_t      pretx_delay_ms;           /**< Pre-transmission delay when switching to TX mode */
} S_X_BAND_Module_Cache;

/*
*********************************************************************************************
* EXTERNAL VARIABLES DEFINITION
*********************************************************************************************
*/
static uint16_t              S_X_Band_Index = 0;                                           /* Number of received bytes */
static uint8_t               S_X_BAND_TRNSM_X_Band_Data[S_X_BAND_TRNSM_RX_BUFF_SIZE];      /* Buffer for row data from the S-band transmitter - includes header, information about the packet and the data itself */
static uint8_t               S_X_BAND_TRNSM_Result_Rx_Buffer[S_X_BAND_TRNSM_RX_BUFF_SIZE]; /* The received data that has been requested */
static __ALIGN_BEGIN uint8_t S_X_BAND_DMA_Buffer[2 * S_X_BAND_PACK_SIZE] __ALIGN_END;

/** Configuration interface for the system instancer */
if_sys_mod_t sx_band_module_configuration = {
    .init   = sx_band_init,
    .run    = sx_band_run,
    .stop   = sx_band_stop,
    .deinit = sx_band_deinit,
};

/*
*********************************************************************************************
* INTERNAL (STATIC) VARIABLES DEFINITION/DECLARATION
*********************************************************************************************
*/

INIT_CMP_LOGGER(true, TRACE_LVL_WARN)

static __ALIGN_BEGIN uint8_t   TxDataBuffer[S_X_BAND_TRNSM_TX_BUFF_SIZE] __ALIGN_END; /* Buffer for the data that is going to be transmitted */
static uint32_t                S_X_BAND_TRNSM_S_Current_Baudrate;                     /* Currently used baudrate */
static uint32_t                S_X_BAND_LastExecCmd_Tick;                             /* How much ticks has passed from the last executed command */
static S_X_BAND_Selection_Enum SX_BAND_Select_Module = SX_SELECT_NONE;

/** Descriptor of all commands: Gives the Value of the command and it's maximum size */
static const S_X_BAND_TRNSM_CMD_INFO_TxInfo_struct TxCMD_Descriptor[S_X_BAND_TRNSM_CMD_NUMBER] = {
  /* X_BAND_TRNSM_CMD_GET,          */ {S_X_BAND_TRNSM_CMD_VAL_GET,            0,                              12                            },
 /* X_BAND_TRNSM_CMD_SET,          */
    { S_X_BAND_TRNSM_CMD_VAL_SET,           112,                            1                             },
 /* X_BAND_TRNSM_CMD_DIR_F,        */
    { S_X_BAND_TRNSM_CMD_VAL_DIR_F,         0,                              S_X_BAND_TRNSM_MAX_READ_BUFFER},
 /* X_BAND_TRNSM_CMD_DIR_NEXT_F,   */
    { S_X_BAND_TRNSM_CMD_VAL_DIR_NEXT_F,    0,                              S_X_BAND_TRNSM_MAX_READ_BUFFER},
 /* X_BAND_TRNSM_CMD_DELL_F,       */
    { S_X_BAND_TRNSM_CMD_VAL_DELL_F,        31,                             1                             },
 /* X_BAND_TRNSM_CMD_DELL_ALL_F,   */
    { S_X_BAND_TRNSM_CMD_VAL_DELL_ALL_F,    0,                              1                             },
 /* X_BAND_TRNSM_CMD_CREATE_F,     */
    { S_X_BAND_TRNSM_CMD_VAL_CREATE_F,      31,                             1                             },
 /* X_BAND_TRNSM_CMD_WRITE_F,      */
    { S_X_BAND_TRNSM_CMD_VAL_WRITE_F,       S_X_BAND_TRNSM_MAX_READ_BUFFER, 1                             },
 /* X_BAND_TRNSM_CMD_OPEN_F,       */
    { S_X_BAND_TRNSM_CMD_VAL_OPEN_F,        31,                             1                             },
 /* X_BAND_TRNSM_CMD_READ_F,       */
    { S_X_BAND_TRNSM_CMD_VAL_READ_F,        4,                              S_X_BAND_TRNSM_MAX_READ_BUFFER},
 /* X_BAND_TRNSM_CMD_SEND_F,       */
    { S_X_BAND_TRNSM_CMD_VAL_SEND_F,        31,                             1                             },
 /* X_BAND_TRNSM_CMD_TX_MODE,      */
    { S_X_BAND_TRNSM_CMD_VAL_TX_MODE,       0,                              1                             },
 /* X_BAND_TRNSM_CMD_LOAD_MODE,    */
    { S_X_BAND_TRNSM_CMD_VAL_IDLE_MODE,     0,                              1                             },
 /* X_BAND_TRNSM_CMD_UPDATE_FW,    */
    { S_X_BAND_TRNSM_CMD_VAL_UPDATE_FW,     31,                             1                             },
 /* X_BAND_TRNSM_CMD_SAFE_SHUTDOWN,*/
    { S_X_BAND_TRNSM_CMD_VAL_SAFE_SHUTDOWN, 0,                              1                             },
 /* X_BAND_TRNSM_CMD_GET_RES,      */
    { S_X_BAND_TRNSM_CMD_VAL_GET_RESULT,    2,                              S_X_BAND_TRNSM_MAX_READ_BUFFER}
};

/** @brief command-specific GetResult poll intervals while status is busy (in milliseconds)
 */
static const uint8_t TxCMD_BusyTimePeriod[S_X_BAND_TRNSM_CMD_NUMBER] = {
    /* S_X_BAND_TRNSM_CMD_GET,          */ 1,
    /* S_X_BAND_TRNSM_CMD_SET,          */ 10,
    /* S_X_BAND_TRNSM_CMD_DIR_F,        */ 1,
    /* S_X_BAND_TRNSM_CMD_DIR_NEXT_F,   */ 1,
    /* S_X_BAND_TRNSM_CMD_DELL_F,       */ 200,
    /* S_X_BAND_TRNSM_CMD_DELL_ALL_F,   */ 255,
    /* S_X_BAND_TRNSM_CMD_CREATE_F,     */ 1,
    /* S_X_BAND_TRNSM_CMD_WRITE_F,      */ 1,
    /* S_X_BAND_TRNSM_CMD_OPEN_F,       */ 1,
    /* S_X_BAND_TRNSM_CMD_READ_F,       */ 1,
    /* S_X_BAND_TRNSM_CMD_SEND_F,       */ 255,
    /* S_X_BAND_TRNSM_CMD_TX_MODE,      */ 255,
    /* S_X_BAND_TRNSM_CMD_LOAD_MODE,    */ 10,
    /* S_X_BAND_TRNSM_CMD_UPDATE_FW,    */ 10,
    /* S_X_BAND_TRNSM_CMD_SAFE_SHUTDOWN,*/ 1,
    /* S_X_BAND_TRNSM_CMD_GET_RES,      */ 1
};

/** Supported baudrates */
static const uint32_t BaudRateArray[] = {
    250000,  // 0 250kHz
    500000,  // 1 500kHz
    1000000, // 2 1MHz
    2000000, // 3 2MHz
    3000000, // 4 3MHz
    5000000, // 5 5MHz
};

/** @brief ModCod coefficients for downlink worst-case timeout estimation
 *  Refer to SXBand User's Manual for calculation details
 *  - S-Band Transmitter rev. 2.11 / page 68
 *  - X-Band Transmitter rev. 2.5 / page 68
 */
static const float ModCod_BitRate_Coeffs[] = {
    0.481, // QPSK_1/4
    0.643, // QPSK_1/3
    0.774, // QPSK_2/5
    0.968, // QPSK_1/2
    1.163, // QPSK_3/5
    1.294, // QPSK_2/3
    1.455, // QPSK_3/4
    1.551, // QPSK_4/5
    1.618, // QPSK_5/6
    1.727, // QPSK_8/9
    1.749, // QPSK_9/10
    1.744, // 8PSK_3/5
    1.940, // 8PSK_2/3
    2.182, // 8PSK_3/4
    2.427, // 8PSK_5/6
    2.590, // 8PSK_8/9
    2.623, // 8PSK_9/10
    2.580, // 16APSK_2/3
    2.902, // 16APSK_3/4
    3.096, // 16APSK_4/5
    3.227, // 16APSK_5/6
    3.445, // 16APSK_8/9
    3.487, // 16APSK_9/10
    3.630, // 32APSK_3/4
    3.973, // 32APSK_4/5
    4.037, // 32APSK_5/6
    4.310, // 32APSK_8/9
    4.364, // 32APSK_9/10
};

