J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
/* Stack-related */
/** Stack structure */
static S_X_BAND_CMD_StackEntry XSBandStack[S_X_BAND_STACK_SIZE];
static S_X_BAND_CMD_StackEntry XSBandStack_Slave;

/* Driver device type */
static S_X_BAND_TRNSM_DEVTYPE XSBandDevType = S_X_BAND_TRNSM_DEVTYPE_UNKNOWN;

/** @brief SXBand local cache information and validity status */
static S_X_BAND_Module_Cache moduleCacheInfo = {
    .in_progress          = false,
    .file_cache_valid     = false,
    .settings_cache_valid = false,
    .modcod               = INVALID_SETTING_VALUE_1B,
    .sym_rate             = INVALID_SETTING_VALUE_1B,
    .pretx_delay_ms       = INVALID_SETTING_VALUE_2B
};

/*
*********************************************************************************************
* INTERNAL (STATIC) ROUTINES DECLARATION
*********************************************************************************************
*/
static void                     S_X_BAND_TRNSM_Init_Usart(uint32_t baud_rate);
static void                     S_X_BAND_TRNSM_Rx_Tx_State(uint8_t state);
static void                     S_X_BAND_TRNSM_Send_Ack(uint16_t Identifier, S_X_BAND_TRNSM_CMD_enum CMD, uint16_t CMD_Type);
static uint8_t                  S_X_BAND_TRNSM_CMD_GET_Param(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_CMD_SET_Param(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_CMD_Dir(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_CMD_Dir_Extended(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_DelFile(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_CreateFile(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_UploadFileToSBandTrnsm(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_DownloadFileFromSBandTrnsm(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_OpenFile(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_SendFile(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_StartTxMode(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_StartLoadMode(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_FW_Update(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_ShutDownMode(S_X_BAND_CMD_StackEntry *stackEntry);
static uint8_t                  S_X_BAND_TRNSM_CMD_SET_Param_Baudrate(S_X_BAND_CMD_StackEntry *stackEntry);
static void                     XSBandTryFinish(uint8_t retRes, S_X_BAND_CMD_StackEntry *stackEntry);
static S_X_BAND_CMD_EXTRACT_RES XSBandExtractCommandAndType(S_X_BAND_CMD_StackEntry *stackEntry);
static bool                     S_X_BAND_TRNSM_Scan_Baud_Rates(uint16_t Identifier);
static uint8_t                  S_X_BAND_TRNSM_FileNameParser(uint16_t Identifier, uint8_t *FileListBuffer, S_X_BAND_TRNSM_FileInfo_struct *File);
/* Low level functions */
static S_X_BAND_TRNSM_Response_enum S_X_BAND_TRNSM_SendCMD(uint16_t Identifier, S_X_BAND_TRNSM_CMD_enum CMD, uint16_t CMD_Type, const uint8_t *TxData, uint16_t TxDataLength);
static S_X_BAND_TRNSM_Response_enum S_X_BAND_TRNSM_GetResult(uint16_t Identifier, S_X_BAND_TRNSM_CMD_enum CMD, uint16_t CMD_Type, uint8_t *RxData, uint16_t *RxDataLength);
static uint8_t                      S_X_Select(S_X_BAND_Selection_Enum Type);
static void                         S_X_DeSelect(void);
static void                         S_X_BAND_TRNSM_Detect_Band_Type(const uint16_t Identifier);
static uint32_t                     S_X_Band_Get_Cmd_Timeout(uint16_t Identifier, S_X_BAND_TRNSM_GW_CMD_ID_enum Cmd, uint8_t Type, uint8_t size, const uint8_t *pData);
static void                         S_X_Band_On_Dir_List_Start(void);
static void                         S_X_Band_On_Enumerate_File(const S_X_BAND_TRNSM_FileInfo_struct *const pFileInfo);
static void                         S_X_Band_On_Dir_List_Finished(void);
static uint64_t                     S_X_Band_Get_File_Size_From_Cache(const char *const pFilePattern);
static void                         S_X_Band_Update_Module_Cache(uint16_t Identifier);
static void                         S_X_Band_On_CacheUpdateReady(void *const pUserCtx);
static void                         sx_band_init_stack(S_X_BAND_CMD_StackEntry *const p_stack_entry);
static void                         fdir_sx_band_dc_failed_send_cmd(
                            const char                  *str,
                            size_t                       len,
                            S_X_BAND_TRNSM_Response_enum response,
                            uint16_t                     Identifier,
                            S_X_BAND_TRNSM_CMD_enum      CMD,
                            uint16_t                     CMD_Type,
                            uint16_t                     TxDataLength);

/* A function to check whether the radio module is an X-Band type */
static inline bool IS_XBAND(void)
{
    return S_X_BAND_TRNSM_DEVTYPE_XBAND == XSBandDevType;
}

/** @brief A thread handle for the cache update task */
static osThreadId_t cacheUpdateThread = NULL;

/* End of Low level functions */
// Stack callback table
static const S_X_BAND_TRNSM_CMD_callbacks_t XSBandCallbacks[S_X_BAND_TRNSM_CMD_NUMBER] = {
    /* S_X_BAND_TRNSM_CMD_GET */ S_X_BAND_TRNSM_CMD_GET_Param,
    /* S_X_BAND_TRNSM_CMD_SET */ S_X_BAND_TRNSM_CMD_SET_Param,
    /* S_X_BAND_TRNSM_CMD_DIR_F */ S_X_BAND_TRNSM_CMD_Dir_Extended,
    /* S_X_BAND_TRNSM_CMD_DIR_NEXT_F */ S_X_BAND_TRNSM_CMD_Dir_Extended,
    /* S_X_BAND_TRNSM_CMD_DELL_F */ S_X_BAND_TRNSM_DelFile,
    /* S_X_BAND_TRNSM_CMD_DELL_ALL_F */ S_X_BAND_TRNSM_DelFile,
    /* S_X_BAND_TRNSM_CMD_CREATE_F */ S_X_BAND_TRNSM_UploadFileToSBandTrnsm,
    /* S_S_X_BAND_TRNSM_CMD_WRITE_F */ S_X_BAND_TRNSM_UploadFileToSBandTrnsm,
    /* S_X_BAND_TRNSM_CMD_OPEN_F */ S_X_BAND_TRNSM_DownloadFileFromSBandTrnsm,
    /* S_X_BAND_TRNSM_CMD_READ_F */ S_X_BAND_TRNSM_DownloadFileFromSBandTrnsm,
    /* S_X_BAND_TRNSM_CMD_SEND_F */ S_X_BAND_TRNSM_SendFile,
    /* S_X_BAND_TRNSM_CMD_TX_MODE */ S_X_BAND_TRNSM_StartTxMode,
    /* S_X_BAND_TRNSM_CMD_LOAD_MODE */ S_X_BAND_TRNSM_StartLoadMode,
    /* S_X_BAND_TRNSM_CMD_UPDATE_FW */ S_X_BAND_TRNSM_FW_Update,
    /* S_X_BAND_TRNSM_CMD_SAFE_SHUTDOWN */ S_X_BAND_TRNSM_ShutDownMode,
    /* S_X_BAND_TRNSM_CMD_GET_RES */ NULL
};

