J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
static osThreadId_t         S_X_BAND_Task_TaskHandle;
static const osThreadAttr_t S_X_BAND_Task_attributes = {
    .name       = "S_X_BAND_Task",
    .priority   = (osPriority_t)osPriorityAboveNormal,
    .stack_size = 8192
};

static const osMutexAttr_t sxband_lock_attr = {
    "sxband_mutex",   // human readable mutex name
    osMutexRecursive, // attr_bits
    NULL,             // memory for control block
    0U                // size for control block
};

/** @brief Mutex handle provided by the OS */
static osMutexId_t sxband_lock_id;

static UART_HandleTypeDef *p_sx_band_uart_hnd = (UART_HandleTypeDef *)NULL;

/*
*********************************************************************************************
* EXTERNAL (NONE STATIC) ROUTINES DEFINITION
*********************************************************************************************
*/
// System module interface functions
mod_op_status_id_t sx_band_init(sys_init_level_id_t level)
{
    mod_op_status_id_t ret = STATUS_NOT_SUPPORTED;

    // Eventually, to split the initialisation into the different levels
    if (level == INIT_MEM)
    {
        /* MEMORY LEVEL INITIALIZATION */
        /* Reset the in-memory structures */
        for (uint8_t stack_idx = 0; stack_idx < S_X_BAND_STACK_SIZE; stack_idx++)
        {
            sx_band_init_stack(&XSBandStack[stack_idx]);
        }
        sx_band_init_stack(&XSBandStack_Slave);
        memset(TxDataBuffer, 0, S_X_BAND_TRNSM_TX_BUFF_SIZE);
        S_X_BAND_LastExecCmd_Tick = 0;

        es_sxband_config_init();

        p_sx_band_uart_hnd = es_sxband_config_get_usart_hnd();
        CRIT_ASSERT(NULL != p_sx_band_uart_hnd);

        /* Initialize the Current baudrate to default */
        S_X_BAND_TRNSM_S_Current_Baudrate = S_X_BAND_TRNSM_DEFAULT_BAUDRATE;

        XSBandDevType = S_X_BAND_TRNSM_DEVTYPE_UNKNOWN;

        ret = STATUS_OK;
    }
    else if (level == INIT_HW)
    {
        GPIO_InitTypeDef GPIO_InitStruct;

        /* HW LEVEL INITIALIZATION */
        const uint32_t hal_state = HAL_UART_GetState(p_sx_band_uart_hnd);
        if ((hal_state & HAL_UART_STATE_READY) != 0)
        {
            HAL_UART_DMAStop(p_sx_band_uart_hnd);
            HAL_UART_DeInit(p_sx_band_uart_hnd);
        }

        __HAL_RCC_GPIOB_CLK_ENABLE();
        __HAL_RCC_GPIOD_CLK_ENABLE();
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_GPIOI_CLK_ENABLE();

        /* DMA controller clock enable */
        DMA_CLK_ENABLE();

        /* DMA interrupt init */
        /* DMA_Stream1_IRQn interrupt configuration */
        HAL_NVIC_SetPriority(DMA_Stream1_IRQn, 4, 0);
        HAL_NVIC_EnableIRQ(DMA_Stream1_IRQn);
        /* DMA_Stream2_IRQn interrupt configuration */
        HAL_NVIC_SetPriority(DMA_Stream2_IRQn, 4, 0);
        HAL_NVIC_EnableIRQ(DMA_Stream2_IRQn);

        /* USART_IRQ interrupt configuration */
        HAL_NVIC_SetPriority(USART_IRQ, 5, 0);
        HAL_NVIC_EnableIRQ(USART_IRQ);

        S_X_BAND_TRNSM_Init_Usart(S_X_BAND_TRNSM_GetBaudrate());

        HAL_UART_RegisterCallback(p_sx_band_uart_hnd, HAL_UART_RX_HALFCOMPLETE_CB_ID, S_X_BAND_UART_RxHalfCpltCallback);
        HAL_UART_RegisterCallback(p_sx_band_uart_hnd, HAL_UART_RX_COMPLETE_CB_ID, S_X_BAND_UART_RxCpltCallback);
        HAL_UART_RegisterCallback(p_sx_band_uart_hnd, HAL_UART_TX_COMPLETE_CB_ID, S_X_BAND_UART_TxCpltCallback);
        HAL_UART_RegisterCallback(p_sx_band_uart_hnd, HAL_UART_ERROR_CB_ID, S_X_BAND_UART_ErrorCallback);

        /*Configure GPIO pin Output Level */
        HAL_GPIO_WritePin(SX_BAND_TxEnbl_GPIO_Port, SX_BAND_TxEnblPin, GPIO_PIN_RESET);

        /*Configure GPIO pin : RS485 Transmit enable pin */
        GPIO_InitStruct.Pin   = SX_BAND_TxEnblPin;
        GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull  = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(SX_BAND_TxEnbl_GPIO_Port, &GPIO_InitStruct);

        /* Release the USART interface */
        S_X_DeSelect();

        ret = STATUS_OK;
    }
    else if (level == INIT_OS)
    {
        if (NULL == sxband_lock_id)
        {
            sxband_lock_id = osMutexNew(&sxband_lock_attr);
        }

        S_X_BAND_Task_TaskHandle = osThreadNew(S_X_BAND_Task, NULL, &S_X_BAND_Task_attributes);
        CRIT_ASSERT(S_X_BAND_Task_TaskHandle);
        task_mon_register_for_stats(TASK_ID_S_X_BAND, S_X_BAND_Task_TaskHandle);

        // Set the task monitor policy
        task_mon_set_task_policy(TASK_ID_S_X_BAND, TASK_MON_POLICY_MONITOR);
        ret = STATUS_OK;
    }
    else
    {
        ret = STATUS_NOT_SUPPORTED;
        ;
    }

    return ret;
}
mod_op_status_id_t sx_band_run()
{
    // This is to be implemented
    return STATUS_NOT_SUPPORTED;
}
mod_op_status_id_t sx_band_stop()
{
    (void)osMutexAcquire(sxband_lock_id, osWaitForever);

    sx_band_init(INIT_MEM);
    sx_band_init(INIT_HW);

    (void)osMutexRelease(sxband_lock_id);

    return STATUS_OK;
}
mod_op_status_id_t sx_band_deinit(sys_init_level_id_t level)
{
    // Hardware and OS levels
    if (level == INIT_HW)
    {
        p_sx_band_uart_hnd = es_sxband_config_get_usart_hnd();
        CRIT_ASSERT(NULL != p_sx_band_uart_hnd);
        /* HW LEVEL DEINITIALIZATION */

        const uint32_t hal_state = HAL_UART_GetState(p_sx_band_uart_hnd);
        if ((hal_state & HAL_UART_STATE_READY) != 0)
        {
            HAL_UART_DMAStop(p_sx_band_uart_hnd);
            HAL_UART_DeInit(p_sx_band_uart_hnd);
        }

        GPIO_InitTypeDef GPIO_InitStruct = { 0 };

        HAL_GPIO_WritePin(U3_RS485_S1_DE_GPIO_Port, U3_RS485_S1_DE_Pin, GPIO_PIN_RESET);

        /*Configure GPIO pins : U3_RS485_S1_DE_Pin */
        GPIO_InitStruct.Pin   = U3_RS485_S1_DE_Pin;
        GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull  = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(U3_RS485_S1_DE_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin   = U3_RS485_S1_nRE_Pin;
        GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull  = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(U3_RS485_S1_nRE_GPIO_Port, &GPIO_InitStruct);

