J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
        GPIO_InitStruct.Pin  = U3_RS485_S1_RX_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(U3_RS485_S1_RX_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin  = U3_RS485_S1_TX_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(U3_RS485_S1_TX_GPIO_Port, &GPIO_InitStruct);
    }
    else if (level == INIT_OS)
    {
        task_mon_set_task_policy(TASK_ID_S_X_BAND, TASK_MON_POLICY_DONT_CARE);
    }

    return STATUS_OK;
}

uint32_t S_X_BAND_TRNSM_GetBaudrate(void)
{
    return BaudRateArray[S_X_BAND_TRNSM_S_Current_Baudrate];
}

static void S_X_BAND_TRNSM_Init_Usart(uint32_t baud_rate)
{
    p_sx_band_uart_hnd->Init.BaudRate               = baud_rate;
    p_sx_band_uart_hnd->Init.WordLength             = UART_WORDLENGTH_8B;
    p_sx_band_uart_hnd->Init.StopBits               = UART_STOPBITS_1;
    p_sx_band_uart_hnd->Init.Parity                 = UART_PARITY_NONE;
    p_sx_band_uart_hnd->Init.Mode                   = UART_MODE_TX_RX;
    p_sx_band_uart_hnd->Init.HwFlowCtl              = UART_HWCONTROL_NONE;
    p_sx_band_uart_hnd->Init.OverSampling           = UART_OVERSAMPLING_8;
    p_sx_band_uart_hnd->Init.OneBitSampling         = UART_ONE_BIT_SAMPLE_DISABLE;
    p_sx_band_uart_hnd->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(p_sx_band_uart_hnd) != HAL_OK)
    {
        Error_Handler();
    }
}

/*
********************************************************************************************
* INTERNAL (STATIC) ROUTINES DEFINITION
********************************************************************************************
*/

static uint8_t S_X_Select(S_X_BAND_Selection_Enum Type)
{
    uint8_t retVal;

    if ((Type < SX_SELECT_NONE) && (SX_BAND_Select_Module >= SX_SELECT_NONE))
    {
        SX_BAND_Select_Module = Type;
        retVal                = pdTRUE;
    }
    else
    {
        retVal = pdFALSE;
    }

    return retVal;
}

static void S_X_DeSelect(void)
{
    SX_BAND_Select_Module = SX_SELECT_NONE;
}

static void fdir_sx_band_dc_failed_send_cmd(
    const char                  *str,
    size_t                       len,
    S_X_BAND_TRNSM_Response_enum response,
    uint16_t                     Identifier,
    S_X_BAND_TRNSM_CMD_enum      CMD,
    uint16_t                     CMD_Type,
    uint16_t                     TxDataLength)
{
    DATA_CACHE_FDIR_S_X_BAND_CMD_EXEC_STATUS_t exec_status;
    bool                                       error_occured;
    exec_status.u16Error_code = response;
    fdir_srv_log_if_clear(FDIR_FAULT_S_X_BAND_CMD_EXEC_FAILURE, FDIR_AGENT_S_X_BAND, "%.*s. S/X-Band command failed with err code %d, id: %u, cmd: %d, cmd_type: %u, data_len: %u",
                          len,
                          str,
                          TxCMD_Descriptor[CMD].tx_data_max_size,
                          response,
                          Identifier,
                          CMD,
                          CMD_Type,
                          TxDataLength);
    dc_set_fdir_s_x_band_cmd_exec_status_data(&exec_status);
    (void)dc_get_fdir_s_x_band_cmd_exec_status_data(&exec_status);
    error_occured = (S_X_BAND_TRNSM_STAT_ACK != response);
    (void)fdir_srv_fault_set_state(FDIR_FAULT_S_X_BAND_CMD_EXEC_FAILURE, FDIR_AGENT_S_X_BAND, error_occured, NULL);
}

/**
 * @brief Send a command to S-Band transmitter
 * @param[input]      Identifier - ID of the used S or X band transmitter
 * @param[input]      CMD - command number from enumeration X_BAND_TRNSM_CMD_enum
 * @param[input]      CMD_Type - Some commands have different types, the rest don't have. Use values as follow:
 *                       + X_BAND_TRNSM_NULL_TYPE - for commands without type
 *                       + value form X_BAND_TRNSM_GET_types_enum - for Command GET (X_BAND_TRNSM_CMD_GET)
 *                       + value from X_BAND_TRNSM_SET_types_enum - for Command SET (X_BAND_TRNSM_CMD_SET)
 *                       + value from X_BAND_TRNSM_SendFile_types_enum - for Command SEND FILE (X_BAND_TRNSM_CMD_SEND_F)
 *                       + value from X_BAND_TRNSM_SendFile_types_enum - for Command SEND FILE (X_BAND_TRNSM_CMD_SEND_F)
 * @param[input]      TxData - Data that is going to be transmitted. If the command does not require TxData can be = NULL
 * @param[input]      TxDataLength - Number of bytes to be transmitted
 *
 * @return            retStat - a value from enumeration S_X_BAND_TRNSM_Response_enum
 */
static S_X_BAND_TRNSM_Response_enum S_X_BAND_TRNSM_SendCMD(uint16_t Identifier, S_X_BAND_TRNSM_CMD_enum CMD, uint16_t CMD_Type, const uint8_t *TxData, uint16_t TxDataLength)
{
    S_X_BAND_TRNSM_Pack_struct *RxPackStruct = (S_X_BAND_TRNSM_Pack_struct *)S_X_BAND_TRNSM_X_Band_Data;
    S_X_BAND_TRNSM_Pack_struct *TxPackStruct = (S_X_BAND_TRNSM_Pack_struct *)TxDataBuffer;
    uint32_t                    RxCRC;
    uint32_t                   *pRxCRC;
    uint32_t                    TxPackCRC = 0;
    char                        err_buf[48];
    size_t                      len;

    if (CMD >= S_X_BAND_TRNSM_CMD_GET_RES)
    {
        /* allow all commands but Get result */
        fdir_sx_band_dc_failed_send_cmd(STR_INVALID_DATA_PTR, sizeof(STR_INVALID_DATA_PTR), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, TxDataLength);
        return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
    }
    if ((TxDataLength + sizeof(S_X_BAND_TRNSM_Pack_struct) + sizeof(RxCRC)) > S_X_BAND_TRNSM_TX_BUFF_SIZE)
    {
        /* if CPU stops here - please increase the size of the buffer -> X_BAND_TRNSM_TX_BUFF_SIZE */
        len = (size_t)snprintf(err_buf, sizeof(err_buf), "Data length too long (above %u).", S_X_BAND_TRNSM_TX_BUFF_SIZE - sizeof(S_X_BAND_TRNSM_Pack_struct) + sizeof(RxCRC));
        len = (len < sizeof(err_buf)) ? len : sizeof(err_buf);
        fdir_sx_band_dc_failed_send_cmd(err_buf, len, S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, TxDataLength);
        return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
    }
    // Stack timeout
    if ((xTaskGetTickCount() - S_X_BAND_LastExecCmd_Tick) < (1 * S_X_BAND_STACK_DELAY))
    {
        fdir_sx_band_dc_failed_send_cmd(STR_STACK_TIMEOUT, sizeof(STR_STACK_TIMEOUT), S_X_BAND_TRNSM_STAT_GET_RESULT, Identifier, CMD, CMD_Type, TxDataLength);
        return S_X_BAND_TRNSM_STAT_GET_RESULT;
    }
    TxPackStruct->Header   = S_X_BAND_TRNSM_HEADER;
    TxPackStruct->ModuleID = Identifier;
    if (TxCMD_Descriptor[CMD].tx_data_max_size > 0)
    {
        if (TxCMD_Descriptor[CMD].tx_data_max_size >= TxDataLength)
        {
            TxPackStruct->Length = TxDataLength;
        }
        else
        {
            len = snprintf(err_buf, sizeof(err_buf), "Data unexpectedly long (above %u).", TxCMD_Descriptor[CMD].tx_data_max_size);
            len = (len < sizeof(err_buf)) ? len : sizeof(err_buf);
            fdir_sx_band_dc_failed_send_cmd(err_buf, len, S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, TxDataLength);
            return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
        }
    }
    else
    {
        TxPackStruct->Length = 0;
    }
    TxPackStruct->Response = 0;
    TxPackStruct->CMD      = TxCMD_Descriptor[CMD].CMD;
    TxPackStruct->Type     = CMD_Type;
    if (TxPackStruct->Length > 0)
    {
        if (!TxData)
        {
            /* Invalid data pointer */
            fdir_sx_band_dc_failed_send_cmd(STR_INVALID_DATA_PTR, sizeof(STR_INVALID_DATA_PTR), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, TxDataLength);
            return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
        }
        /* copy the data of the packet to the transmit buffer, after the structure */
        memcpy(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE], TxData, TxPackStruct->Length);

        /* copy the CRC to the transmit buffer after the data */
        TxPackCRC = crc32(0, (BYTE *)TxPackStruct, S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length);
        memcpy(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length], &TxPackCRC, sizeof(TxPackCRC));
    }
    else
    {
        TxPackCRC = crc32(0, (BYTE *)TxPackStruct, S_X_BAND_TRNSM_STRCT_SIZE);
        /* copy the CRC to the transmit buffer after the structure of the packet */
        memcpy(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE], &TxPackCRC, sizeof(TxPackCRC));
    }
    for (uint8_t retries = 0; retries < S_X_BAND_TRNSM_TX_RETRY;)
    {
        /* check if the transmit buffer is insufficient */
        if (((((S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC) - 1) >> 4) + 1) << 4) > sizeof(TxDataBuffer))
        {
            S_X_BAND_LastExecCmd_Tick = xTaskGetTickCount();
            fdir_sx_band_dc_failed_send_cmd(STR_TXBUF_LOW, sizeof(STR_TXBUF_LOW), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, TxDataLength);
            return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
        }
        /* Reserve the USART interface for X-band */
        if (pdFALSE == S_X_Select(SX_SELECT_X_BAND_TRANSCEIVER))
        {
            S_X_BAND_LastExecCmd_Tick = xTaskGetTickCount();
            fdir_sx_band_dc_failed_send_cmd(STR_UART_RESERVED, sizeof(STR_UART_RESERVED), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, TxDataLength);
            return S_X_BAND_TRNSM_STAT_COMM_ERR;
        }

