J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
        osThreadFlagsClear(S_X_BAND_TASK_DMA_FLAG);
        S_X_Band_Index           = 0;
        HAL_StatusTypeDef HalRes = HAL_UART_Receive_DMA(p_sx_band_uart_hnd, S_X_BAND_DMA_Buffer, 2 * S_X_BAND_PACK_SIZE);

        if (HAL_OK != HalRes)
        {
            (void)HAL_UART_AbortReceive_IT(p_sx_band_uart_hnd);
        }
        // Clear the extra bytes that will be set after the packet to complete to divisible to 16
        memset(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC)], 0, ((((S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC) - 1) >> 4) + 1) << 4) - (S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC)));
        S_X_BAND_TRNSM_Rx_Tx_State(1);
        (void)HAL_UART_Transmit_DMA(p_sx_band_uart_hnd, TxDataBuffer, (((S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC) - 1) >> 4) + 1) << 4);
        (void)osThreadFlagsWait(S_X_BAND_TASK_DMA_FLAG, osFlagsWaitAny, S_X_BAND_CMD_RESP_DELAY);

        HAL_UART_AbortReceive(p_sx_band_uart_hnd); // the packet is received, no need to continued receiving (the DMA buffer is bigger then the packet and will never be filled with one packet)
        /* Release the USART interface */
        S_X_DeSelect();

        if (S_X_Band_Index > 0)
        {
            S_X_Band_Index = 0;
            // check for end of pack and verify the packet
            if (
                (RxPackStruct->Header == TxPackStruct->Header) &&
                (RxPackStruct->ModuleID == TxPackStruct->ModuleID))
            {
                RxCRC  = crc32(0, S_X_BAND_TRNSM_X_Band_Data, S_X_BAND_TRNSM_STRCT_SIZE);
                pRxCRC = (uint32_t *)&S_X_BAND_TRNSM_X_Band_Data[S_X_BAND_TRNSM_STRCT_SIZE];
                if (*pRxCRC == RxCRC)
                {
                    if (RxPackStruct->Response == S_X_BAND_TRNSM_STAT_ACK)
                    {
                        retries = S_X_BAND_TRNSM_TX_RETRY; // exit the loop

                        // This delay is absolutely necessary for proper GetResult response, otherwise NCE my occur
                        osDelay(2);
                    }
                    else
                    {
                        RxPackStruct->Response = S_X_BAND_TRNSM_STAT_NACK;
                        // retry - send the packet again
                    }
                }
                else
                {
                    // wrong CRC
                    RxPackStruct->Response = S_X_BAND_TRNSM_STAT_COMM_ERR;
                    // retry - send the packet again
                }
            }
            else
            {
                // wrong data structure
                RxPackStruct->Response = S_X_BAND_TRNSM_STAT_COMM_ERR;
                // retry - send the packet again
            }
        }
        else
        {
            // none bytes are received
            RxPackStruct->Response = S_X_BAND_TRNSM_STAT_COMM_ERR;
            // retry - send the packet again - due to timeout with on answer
        }
        if (retries < S_X_BAND_TRNSM_TX_RETRY)
        {
            retries++;
        }
    }
    S_X_BAND_LastExecCmd_Tick = xTaskGetTickCount();

    DATA_CACHE_FDIR_S_X_BAND_CMD_EXEC_STATUS_t exec_status;
    exec_status.u16Error_code = RxPackStruct->Response;
    dc_set_fdir_s_x_band_cmd_exec_status_data(&exec_status);
    (void)dc_get_fdir_s_x_band_cmd_exec_status_data(&exec_status);
    if ((S_X_BAND_TRNSM_STAT_ACK != (S_X_BAND_TRNSM_Response_enum)exec_status.u16Error_code) &&
        (S_X_BAND_TRNSM_STAT_GET_RESULT != (S_X_BAND_TRNSM_Response_enum)RxPackStruct->Response))
    {
        fdir_sx_band_dc_failed_send_cmd("", 0, RxPackStruct->Response, Identifier, CMD, CMD_Type, TxDataLength);
    }
    else
    {
        (void)fdir_srv_fault_set_state(FDIR_FAULT_S_X_BAND_CMD_EXEC_FAILURE, FDIR_AGENT_S_X_BAND, false, NULL);
    }
    return (S_X_BAND_TRNSM_Response_enum)RxPackStruct->Response;
}

/**
 * @brief Gets the result of a command that have been transmitted recently
 * @param[input]      Identifier - ID of the used S or X band transmitter
 * @param[input]      CMD - command number from enumeration X_BAND_TRNSM_CMD_enum, that was already transmitted
 * @param[input]      CMD_Type - value from enumeration X_BAND_TRNSM_RetRes_enum
 * @param[output]     RxData - Data that is going to be received. If the command does not require RxData can be = NULL
 * @param[output]     RxDataLength - Number of bytes to be received
 *
 * @return            retStat - a value from enumeration S_X_BAND_TRNSM_Response_enum
 */
static S_X_BAND_TRNSM_Response_enum S_X_BAND_TRNSM_GetResult(uint16_t Identifier, S_X_BAND_TRNSM_CMD_enum CMD, uint16_t CMD_Type, uint8_t *RxData, uint16_t *RxDataLength)
{
    S_X_BAND_TRNSM_Pack_struct *RxPackStruct = (S_X_BAND_TRNSM_Pack_struct *)S_X_BAND_TRNSM_X_Band_Data;
    S_X_BAND_TRNSM_Pack_struct *TxPackStruct = (S_X_BAND_TRNSM_Pack_struct *)TxDataBuffer;
    uint32_t                    RxCRC;
    uint32_t const             *pRxCRC;
    uint32_t                    TxPackCRC = 0;

    if (!RxDataLength)
    {
        /* Invalid data pointer */
        fdir_sx_band_dc_failed_send_cmd(STR_INVALID_DATA_LEN, sizeof(STR_INVALID_DATA_LEN), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, 0);
        return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
    }
    else
    {
        /* default value - 0 byes have been read */
        *RxDataLength = 0;
    }
    if (!RxData)
    {
        /* Invalid data pointer */
        fdir_sx_band_dc_failed_send_cmd(STR_INVALID_DATA_PTR, sizeof(STR_INVALID_DATA_PTR), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, *RxDataLength);
        return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
    }
    TxPackStruct->Header   = S_X_BAND_TRNSM_HEADER;
    TxPackStruct->ModuleID = Identifier;
    TxPackStruct->Response = 0;
    TxPackStruct->CMD      = TxCMD_Descriptor[S_X_BAND_TRNSM_CMD_GET_RES].CMD;
    TxPackStruct->Type     = TxCMD_Descriptor[CMD].CMD;
    if ((CMD == S_X_BAND_TRNSM_CMD_GET) ||
        (CMD == S_X_BAND_TRNSM_CMD_SET) ||
        (CMD == S_X_BAND_TRNSM_CMD_SEND_F))
    {
        /* copy the type of the command */
        TxPackStruct->Length                        = 2;
        TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE]     = (uint8_t)CMD_Type;
        TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + 1] = (uint8_t)(CMD_Type >> 8);
    }
    else
    {
        TxPackStruct->Length = 0;
    }

    /* copy the structure of the packet to the transmit buffer */
    TxPackCRC = crc32(0, (BYTE *)TxPackStruct, S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length);
    /* copy the CRC to the transmit buffer after the structure of the packet */
    memcpy(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length], &TxPackCRC, sizeof(TxPackCRC));
    for (uint8_t retries = 0; retries < S_X_BAND_TRNSM_TX_RETRY;)
    {
        /* check if the transmit buffer is insufficient */
        if (((((S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC) - 1) >> 4) + 1) << 4) > sizeof(TxDataBuffer))
        {
            fdir_sx_band_dc_failed_send_cmd(STR_TXBUF_LOW, sizeof(STR_TXBUF_LOW), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, *RxDataLength);
            return S_X_BAND_TRNSM_STAT_WRONG_PARAM;
        }
        /* Reserve the USART interface for X-band */
        if (pdFALSE == S_X_Select(SX_SELECT_X_BAND_TRANSCEIVER))
        {
            fdir_sx_band_dc_failed_send_cmd(STR_UART_RESERVED, sizeof(STR_UART_RESERVED), S_X_BAND_TRNSM_STAT_WRONG_PARAM, Identifier, CMD, CMD_Type, *RxDataLength);
            return S_X_BAND_TRNSM_STAT_COMM_ERR;
        }

