J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
        osThreadFlagsClear(S_X_BAND_TASK_DMA_FLAG);
        S_X_Band_Index           = 0;
        HAL_StatusTypeDef HalRes = HAL_UART_Receive_DMA(p_sx_band_uart_hnd, S_X_BAND_DMA_Buffer, 2 * S_X_BAND_PACK_SIZE);

        if (HAL_OK != HalRes)
        {
            (void)HAL_UART_AbortReceive_IT(p_sx_band_uart_hnd);
        }
        // Clear the extra bytes that will be set after the packet to complete to divisible to 16
        memset(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC)], 0, ((((S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC) - 1) >> 4) + 1) << 4) - (S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC)));
        S_X_BAND_TRNSM_Rx_Tx_State(1);
        (void)HAL_UART_Transmit_DMA(p_sx_band_uart_hnd, TxDataBuffer, (((S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length + sizeof(TxPackCRC) - 1) >> 4) + 1) << 4);
        (void)osThreadFlagsWait(S_X_BAND_TASK_DMA_FLAG, osFlagsWaitAny, S_X_BAND_GET_RESULT_DELAY);

        (void)HAL_UART_AbortReceive(p_sx_band_uart_hnd); // the packet is received, no need to continued receiving (the DMA buffer is bigger then the packet and will never be filled with one packet)
        /* Release the USART interface */
        S_X_DeSelect();

        ES_TRACE_DEBUG("hdr: 0x%08x mod: 0x%04x len: %ld cmd: 0x%04x type: %ld resp: %ld\r\n", RxPackStruct->Header, RxPackStruct->ModuleID, RxPackStruct->Length, RxPackStruct->CMD, RxPackStruct->Type, RxPackStruct->Response);

        if (S_X_Band_Index > 0)
        {
            S_X_Band_Index = 0;
            // check for end of pack and verify the packet
            if (
                (RxPackStruct->Header == TxPackStruct->Header) &&
                (RxPackStruct->ModuleID == TxPackStruct->ModuleID))
            {
                RxCRC  = crc32(0, S_X_BAND_TRNSM_X_Band_Data, S_X_BAND_TRNSM_STRCT_SIZE + RxPackStruct->Length);
                pRxCRC = (uint32_t *)&S_X_BAND_TRNSM_X_Band_Data[S_X_BAND_TRNSM_STRCT_SIZE + RxPackStruct->Length];

                ES_TRACE_DEBUG("RxCRC = 0x%08x RcvdCRC = 0x%08x\r\n", RxCRC, *pRxCRC);

                if (*pRxCRC == RxCRC)
                {
                    if (RxPackStruct->Response == S_X_BAND_TRNSM_STAT_BUSY)
                    {
                        osDelay(TxCMD_BusyTimePeriod[CMD]);
                        break;
                    }
                    else
                    {                                      // Constant looping between states !!!!!!!!!!!!!!!!!!!!!!!
                        retries = S_X_BAND_TRNSM_TX_RETRY; // exit the loop
                        if (RxPackStruct->Response == S_X_BAND_TRNSM_STAT_GET_RESULT)
                        {
                            // Copy the length of data
                            *RxDataLength = RxPackStruct->Length;
                            // copy the data
                            memcpy(RxData, &S_X_BAND_TRNSM_X_Band_Data[S_X_BAND_TRNSM_STRCT_SIZE], RxPackStruct->Length);
                            S_X_BAND_TRNSM_Send_Ack(Identifier, CMD, CMD_Type);
                        }
                    }
                }
            }
        }

        if (retries < S_X_BAND_TRNSM_TX_RETRY)
        {              // If maximum number of retries is not reached
            retries++; // Count one more retry
            if (retries == S_X_BAND_TRNSM_TX_RETRY)
            { // If last retry is done
                RxPackStruct->Response = S_X_BAND_TRNSM_STAT_NACK;
            }
            else
            {
                // Retry
            }
        }
    }

    DATA_CACHE_FDIR_S_X_BAND_CMD_EXEC_STATUS_t exec_status;
    bool                                       activate_fault;

    exec_status.u16Error_code = RxPackStruct->Response;
    dc_set_fdir_s_x_band_cmd_exec_status_data(&exec_status);
    (void)dc_get_fdir_s_x_band_cmd_exec_status_data(&exec_status);

    activate_fault = ((S_X_BAND_TRNSM_STAT_ACK != exec_status.u16Error_code) &&
                      (S_X_BAND_TRNSM_STAT_GET_RESULT != exec_status.u16Error_code));

    fdir_srv_log_if_not_same(FDIR_FAULT_S_X_BAND_CMD_EXEC_FAILURE, FDIR_AGENT_S_X_BAND, activate_fault, "S/X-Band command failed with err code %d, id: %u, cmd: %d, cmd_type: %u, data_len: %u",
                             TxCMD_Descriptor[CMD].tx_data_max_size,
                             RxPackStruct->Response,
                             Identifier,
                             CMD,
                             CMD_Type,
                             *RxDataLength);

    (void)fdir_srv_fault_set_state(FDIR_FAULT_S_X_BAND_CMD_EXEC_FAILURE, FDIR_AGENT_S_X_BAND, activate_fault, NULL);

    return (S_X_BAND_TRNSM_Response_enum)RxPackStruct->Response;
}

/**
 * @brief Change the Setting: Baudrate
 * @param[input]      stackEntry - current stack entry
 *
 * @return            retStat - a value from enumeration X_BAND_TRNSM_SetGetParams_enum
 */
static uint8_t S_X_BAND_TRNSM_CMD_SET_Param_Baudrate(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t         retStat = 0x00;
    uint16_t        RxDataLength;
    static uint32_t Current_Baudrate_Temp;
    uint8_t         pBaudrate = *((uint8_t *)stackEntry->ESTTC_data);

    // Check the requested baud rate
    if (pBaudrate >= CDEF_ELEMENT_COUNT(BaudRateArray))
    {
        retStat = S_X_BAND_TRNSM_PARAMS_PARAMS_ERR;
        return retStat;
    }
    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = 0x01;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            Current_Baudrate_Temp             = S_X_BAND_TRNSM_S_Current_Baudrate;
            S_X_BAND_TRNSM_S_Current_Baudrate = pBaudrate;
            // Send command
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, &pBaudrate, sizeof(pBaudrate));
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }

            stackEntry->timestamp = xTaskGetTickCount();
            // Change to the new baudrate
            S_X_BAND_TRNSM_Init_Usart(BaudRateArray[pBaudrate]);
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (sizeof(retStat) == RxDataLength)
                {
                    // Update the state
                    stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    if ((retStat == S_X_BAND_TRNSM_PARAMS_OK) || (retStat == S_X_BAND_TRNSM_PARAMS_PARAMS_ERR))
                    {
                        if (retStat == S_X_BAND_TRNSM_PARAMS_OK)
                        {
                            S_X_BAND_TRNSM_S_Current_Baudrate = pBaudrate;
                        }
                        break;
                    }
                }
                else
                {
                    // Go back to the previous baud rate
                    S_X_BAND_TRNSM_S_Current_Baudrate = Current_Baudrate_Temp;
                    S_X_BAND_TRNSM_Init_Usart(S_X_BAND_TRNSM_GetBaudrate());
                }
            }
            else
            {
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;

                    if (stackEntry->retries <= 1) // on last try to get results change the baudrate back to normal
                    {
                        // Go back to the previous baud rate
                        S_X_BAND_TRNSM_S_Current_Baudrate = Current_Baudrate_Temp;
                        S_X_BAND_TRNSM_Init_Usart(S_X_BAND_TRNSM_GetBaudrate());
                    }
                }
            }

            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/**
 * @brief Lists all available files in the SD card
 * @param[input]      stackEntry - current stack entry
 *
 * @return            retStat - a value from enumeration X_BAND_TRNSM_Dir_enum
 */
static uint8_t S_X_BAND_TRNSM_CMD_Dir(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t                         retStat = 0x00;
    uint16_t                        RxDataLength;
    S_X_BAND_TRNSM_FileList_struct *DirData = (S_X_BAND_TRNSM_FileList_struct *)stackEntry->ESTTC_data;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, 0, 0);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength >= 4)
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if (retStat == S_X_BAND_TRNSM_DIR_OK || retStat == S_X_BAND_TRNSM_DIR_NO_FILES)
                    {
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        // Copy the data
                        if (retStat == S_X_BAND_TRNSM_DIR_OK)
                        {
                            DirData->DirNextAvailable = S_X_BAND_TRNSM_Result_Rx_Buffer[1];
                            DirData->NumberFiles      = (S_X_BAND_TRNSM_Result_Rx_Buffer[3] << 8) + S_X_BAND_TRNSM_Result_Rx_Buffer[2];
                            memcpy(&stackEntry->ESTTC_data[sizeof(DirData->DirNextAvailable) + sizeof(DirData->NumberFiles)], &S_X_BAND_TRNSM_Result_Rx_Buffer[4], RxDataLength - 4);
                            stackEntry->ESTTC_data_size = RxDataLength - 1;
                        }
                        else
                        {
                            DirData->DirNextAvailable = DirData->NumberFiles = 0;
                        }
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/**
 * @brief Lists all available files in the SD card
 * @param[input]      stackEntry - current stack entry
 *
 * @return            retStat - a value from enumeration X_BAND_TRNSM_Dir_enum
 */
static uint8_t S_X_BAND_TRNSM_CMD_Dir_Extended(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t                        retStat = 0x00;
    S_X_BAND_TRNSM_FileList_struct DirData;
    S_X_BAND_TRNSM_FileInfo_struct FileName;
    static uint16_t                S_X_BAND_TRNSM_CMD_Dir_i, S_X_BAND_TRNSM_CMD_Dir_index;

    // Start the complex command sequence
    if (stackEntry->expectSlaveCommand)
    {
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        XSBandStack_Slave.expectSlaveCommand = stackEntry->expectSlaveCommand = 0;
        S_X_BAND_TRNSM_CMD_Dir_i = S_X_BAND_TRNSM_CMD_Dir_index = 0;
        XSBandStack_Slave.parentEntry                           = stackEntry;

