J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
        USER_START_MULTI_BUF_SEQ(XSBandStack_Slave.pUserRespCtx);
        S_X_Band_On_Dir_List_Start();
    }

    retStat = S_X_BAND_TRNSM_CMD_Dir(&XSBandStack_Slave);

    if (retStat)
    {
        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
        USER_COMMIT_MULTI_BUF_SEQ(XSBandStack_Slave.pUserRespCtx);
        S_X_Band_On_Dir_List_Finished();
        return retStat;
    }
    else if (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
    {
        // Check the status
        if (XSBandStack_Slave.ESTTC_data_size >= (sizeof(uint8_t) + sizeof(uint16_t)))
        {
            memcpy(&DirData, XSBandStack_Slave.ESTTC_data, sizeof(uint8_t) + sizeof(uint16_t));
            DirData.FileList = &XSBandStack_Slave.ESTTC_data[sizeof(uint8_t) + sizeof(uint16_t)];
        }

        XSBandStack_Slave.timestamp = xTaskGetTickCount();
        XSBandStack_Slave.state     = S_X_BAND_TRNSM_CMD_STATE_CMD;
        USER_APPEND_FORMATTED_BUF(XSBandStack_Slave.pUserRespCtx, "Page %d, Found files = %d \r\n", S_X_BAND_TRNSM_CMD_Dir_i, DirData.NumberFiles);
        for (uint8_t i = 0; i < DirData.NumberFiles; i++)
        {
            if (pdTRUE == S_X_BAND_TRNSM_FileNameParser(XSBandStack_Slave.devID, &DirData.FileList[S_X_BAND_TRNSM_CMD_Dir_index], &FileName))
            {
                S_X_BAND_TRNSM_CMD_Dir_index += FileName.NameLength + 4;
                USER_APPEND_FORMATTED_BUF(XSBandStack_Slave.pUserRespCtx, "%02d Name: %s ", i, FileName.FileName);
                USER_APPEND_FORMATTED_BUF(XSBandStack_Slave.pUserRespCtx, " [Size: %lu]\r\n", (int)FileName.Size);
                S_X_Band_On_Enumerate_File(&FileName);
            }
            else
            {
                USER_APPEND_FORMATTED_BUF(XSBandStack_Slave.pUserRespCtx, " File name parser Err \r\n");
                retStat                  = 0x01;
                DirData.DirNextAvailable = 0;
                break;
            }
        }

        S_X_BAND_TRNSM_CMD_Dir_i++;

        // Reset the slave command
        XSBandStack_Slave.command         = S_X_BAND_TRNSM_CMD_DIR_NEXT_F;
        XSBandStack_Slave.ESTTC_data_size = 0;
        S_X_BAND_TRNSM_CMD_Dir_index      = 0;

        // Check for more data
        if (!DirData.DirNextAvailable)
        {
            USER_COMMIT_MULTI_BUF_SEQ(XSBandStack_Slave.pUserRespCtx);
            S_X_Band_On_Dir_List_Finished();

            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
        }
    }

    return retStat;
}

/**
 * @brief Lists all available files in the SD card
 * @param[input]      Identifier - ID of the used S or X band transmitter
 * @param[input]      FileListBuffer - FileList from functions X_BAND_TRNSM_CMD_Dir() and X_BAND_TRNSM_CMD_DirNext()
 * @param[output]     File - a buffer where will be written the found filename, the length of the name, and the size of the file
 *
 * @return            pdTRUE - the name of the file has been found, pdFALSE - Error
 */
static uint8_t S_X_BAND_TRNSM_FileNameParser(uint16_t Identifier, uint8_t *FileListBuffer, S_X_BAND_TRNSM_FileInfo_struct *File)
{
    (void)Identifier;

    File->NameLength = strlen((char *)FileListBuffer) + 1; // Get the length of the name of the file + the Null character after it

    if ((File->NameLength > 0) && (File->NameLength <= SXBAND_FILE_NAME_SIZE)) // Verify the length
    {
        /* Get the size of the file */
        const uint32_t *Size = (uint32_t *)&FileListBuffer[File->NameLength];
        File->Size           = *Size;

        (void)memset(File->FileName, 0, sizeof(File->FileName));

        // Copy the name of the file
        memcpy(File->FileName, FileListBuffer, File->NameLength);

        return pdTRUE; // OK
    }

    return pdFALSE; // File name is NOT found
}

/**
 * @brief Delete a file from the SD card of the S-Band transmitter
 * @param[input]      stackEntry - current stack entry
 *
 * @return            retStat - a value from enumeration X_BAND_TRNSM_DellStatus_enum
 */
static uint8_t S_X_BAND_TRNSM_DelFile(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            if (stackEntry->command == S_X_BAND_TRNSM_CMD_DELL_F)
            {
                uint8_t *FileName       = (uint8_t *)stackEntry->ESTTC_data;
                uint8_t  FileNameLength = strlen((char *)FileName) + 1;
                retStat                 = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, FileName, FileNameLength);
            }
            else
            {
                retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, 0, 0);
            }

            ES_TRACE_DEBUG("SXBand CMD res: %d\n", retStat);

            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
                // Delete All operation with multiple files is quite slow, hence the
                // big amount of GetResult retries here
                stackEntry->retries  = S_X_BAND_TRNSM_DELALL_CMD_RETRY;
                stackEntry->minDelay = IS_XBAND() ? XBAND_DEL_FILE_DELAY_MS : SBAND_DEL_FILE_DELAY_MS;
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB((retStat != S_X_BAND_TRNSM_STAT_ACK) && (retStat != S_X_BAND_TRNSM_STAT_GET_RESULT), stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);

