J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
            // preserve the last status to report later
            stackEntry->response = retStat;

            ES_TRACE_DEBUG("Del file GetResult res: %d\n", retStat);

            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];

                    // preserve the last status to report later
                    stackEntry->response = retStat;

                    // If the status is "OK"
                    if ((retStat == S_X_BAND_TRNSM_DELL_OK) || (retStat == S_X_BAND_TRNSM_DELL_NOT_FOUND))
                    {
                        ES_TRACE_DEBUG("Del file GetResult finished with res: %d\n", retStat);

                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/**
 * @brief Create a file in the SD card of the S-Band transmitter
 * @param[input]      stackEntry: current stack entry
 *
 * @return            retStat: a value from enumeration X_BAND_TRNSM_CrateStatus_enum
 */
static uint8_t S_X_BAND_TRNSM_CreateFile(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            if (!stackEntry->fileSize)
            {
                retStat = 0x01;
                break;
            }
            // Should insert FileName + FileSize like that
            memcpy(&(stackEntry->ESTTC_data[stackEntry->ESTTC_data_size]), &stackEntry->fileSize, sizeof(stackEntry->fileSize));
            stackEntry->ESTTC_data_size += sizeof(stackEntry->fileSize);
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, stackEntry->ESTTC_data, stackEntry->ESTTC_data_size);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }

            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat) + sizeof(uint32_t))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if ((retStat == S_X_BAND_TRNSM_CREATE_OK) || (retStat == S_X_BAND_TRNSM_CREATE_ERR))
                    {
                        // Return data
                        if (retStat == S_X_BAND_TRNSM_CREATE_OK)
                        {
                            stackEntry->fileHandler = *((uint32_t *)&S_X_BAND_TRNSM_Result_Rx_Buffer[1]);
                        }
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/**
 * @brief Create a file in the SD card of the S-Band transmitter
 * @param[input]      stackEntry - current stack entry
 *
 * @return            retStat - a value from enumeration X_BAND_TRNSM_OpenStatus_enum
 */
static uint8_t S_X_BAND_TRNSM_OpenFile(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;
    uint8_t *FileName       = (uint8_t *)stackEntry->ESTTC_data;
    uint8_t  FileNameLength = strlen((char *)FileName) + 1;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            // Should insert FileName + FileSize like that
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, FileName, FileNameLength);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();

                ES_TRACE_DEBUG("OpenFile ACK rcvd!\n");
            }
            else
            {
                // Failed to send the command
                ES_TRACE_DEBUG("=> OpenFile NACK!\n");
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);

