J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
            ES_TRACE_DEBUG("OpenFile GetResult: %d\n", retStat);

            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat) + sizeof(uint32_t) + sizeof(uint32_t))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if ((retStat == S_X_BAND_TRNSM_OPEN_OK) || (retStat == S_X_BAND_TRNSM_OPEN_ERR))
                    {
                        // Return data
                        if (retStat == S_X_BAND_TRNSM_OPEN_OK)
                        {
                            stackEntry->fileHandler = *((uint32_t *)&S_X_BAND_TRNSM_Result_Rx_Buffer[1]);
                            stackEntry->fileSize    = *((uint32_t *)&S_X_BAND_TRNSM_Result_Rx_Buffer[5]);
                            ES_TRACE_DEBUG("File info [hnd = 0x%04x, size = %ul\n");
                        }
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
                else
                {
                    // Wrong answer
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Transmit a file from the SD card of the S-Band transmitter trough the radio
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_SendStatus_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_SendFile(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t               retStat = 0x00;
    uint16_t              RxDataLength;
    uint8_t              *FileName       = (uint8_t *)stackEntry->ESTTC_data;
    uint8_t               FileNameLength = strlen((char *)FileName) + 1;
    static timer_handle_t profile_timer;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
            ES_TRACE_DEBUG("sendfile failed\r\n");
            timer_stop(&profile_timer);
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            // Should insert FileName + FileSize like that
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, FileName, FileNameLength);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
                timer_start(&profile_timer);
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];

                    ES_TRACE_DEBUG("sendfile: status = %d\r\n", retStat);

                    // If the status is "OK"
                    if (retStat == S_X_BAND_TRNSM_SEND_OK)
                    {
                        // Update the state
                        ES_TRACE_DEBUG("sendfile finished successfully (%lu ms)\r\n", timer_get_elapsed_time(&profile_timer));
                        timer_stop(&profile_timer);
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Switch the S-Band to transmit mode (Attention: High power consumption)
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_ChangeMode_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_StartTxMode(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            // Should insert FileName + FileSize like that
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, 0, 0);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if (retStat == S_X_BAND_TRNSM_CHANG_MODE_OK)
                    {
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Switch the S-Band to standby mode (Low power consumption)
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_ChangeMode_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_StartLoadMode(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            // Should insert FileName + FileSize like that
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, 0, 0);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if (retStat == S_X_BAND_TRNSM_CHANG_MODE_OK)
                    {
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Change firmware using a file in the SD card of the S-Band transmitter
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_FW_update_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_FW_Update(S_X_BAND_CMD_StackEntry *stackEntry)
{
    typedef enum X_BAND_TRNSM_FW_Update_State_t
    {
        S_X_BAND_TRNSM_FW_Update_State_DIR = 0x00,
        S_X_BAND_TRNSM_FW_Update_State_REPORT,
        S_X_BAND_TRNSM_FW_Update_State_FWUPD,
        S_X_BAND_TRNSM_FW_Update_State_REPORT2,
        S_X_BAND_TRNSM_FW_Update_State_DELAY
    } S_X_BAND_TRNSM_FW_Update_State_t;

