J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
    uint8_t                                     retStat = 0x00;
    static S_X_BAND_TRNSM_FW_Update_State_t     S_X_BAND_TRNSM_FW_Update_State;
    static X_BAND_TRNSM_GET_FullReport_struct   FullReportData_Temp[2];
    static S_BAND_TRNSM_GET_SimpleReport_struct SimpleReportData_Temp[2];

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Start the complex command sequence
    if (stackEntry->expectSlaveCommand)
    {
        memset(FullReportData_Temp, 0x00, sizeof(FullReportData_Temp));
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        XSBandStack_Slave.expectSlaveCommand = stackEntry->expectSlaveCommand = 0;
        XSBandStack_Slave.command                                             = S_X_BAND_TRNSM_CMD_DIR_F;
        XSBandStack_Slave.type                                                = S_X_BAND_TRNSM_NULL_TYPE;
        S_X_BAND_TRNSM_FW_Update_State                                        = S_X_BAND_TRNSM_FW_Update_State_DIR;
        XSBandStack_Slave.parentEntry                                         = stackEntry;
    }
    // Check the global state of the complex command
    switch (S_X_BAND_TRNSM_FW_Update_State)
    {
        case S_X_BAND_TRNSM_FW_Update_State_DIR:
            retStat = S_X_BAND_TRNSM_CMD_Dir(&XSBandStack_Slave);
            if (!retStat && XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
            {
                XSBandStack_Slave.command = S_X_BAND_TRNSM_CMD_GET;
                if (IS_XBAND())
                {
                    XSBandStack_Slave.type = X_BAND_TRNSM_GET_TYPE_FULL_REPORT;
                }
                else
                {
                    XSBandStack_Slave.type = S_X_BAND_TRNSM_GET_TYPE_SIMPLE_REPORT;
                }
                XSBandStack_Slave.retries      = S_X_BAND_TRNSM_CMD_RETRY;
                XSBandStack_Slave.state        = S_X_BAND_TRNSM_CMD_STATE_CMD;
                S_X_BAND_TRNSM_FW_Update_State = S_X_BAND_TRNSM_FW_Update_State_REPORT;
            }
            break;
        case S_X_BAND_TRNSM_FW_Update_State_REPORT:
            retStat = S_X_BAND_TRNSM_CMD_GET_Param(&XSBandStack_Slave);
            if ((!retStat) && (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED))
            {
                XSBandStack_Slave.command      = S_X_BAND_TRNSM_CMD_UPDATE_FW;
                XSBandStack_Slave.type         = S_X_BAND_TRNSM_NULL_TYPE;
                XSBandStack_Slave.retries      = S_X_BAND_TRNSM_CMD_RETRY;
                XSBandStack_Slave.state        = S_X_BAND_TRNSM_CMD_STATE_CMD;
                S_X_BAND_TRNSM_FW_Update_State = S_X_BAND_TRNSM_FW_Update_State_FWUPD;
                if (IS_XBAND())
                {
                    memcpy(&FullReportData_Temp[0], XSBandStack_Slave.ESTTC_data, XSBandStack_Slave.ESTTC_data_size);
                }
                else
                {
                    memcpy(&SimpleReportData_Temp[0], XSBandStack_Slave.ESTTC_data, XSBandStack_Slave.ESTTC_data_size);
                }
            }
            break;
        case S_X_BAND_TRNSM_FW_Update_State_FWUPD:
            retStat = S_X_BAND_TRNSM_SendCMD(XSBandStack_Slave.devID, S_X_BAND_TRNSM_CMD_UPDATE_FW, S_X_BAND_TRNSM_NULL_TYPE, (uint8_t *)((char *)stackEntry->ESTTC_data), (uint16_t)(strlen((char *)stackEntry->ESTTC_data) + 1));
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                XSBandStack_Slave.timestamp = stackEntry->timestamp = xTaskGetTickCount();
                XSBandStack_Slave.command                           = S_X_BAND_TRNSM_CMD_GET;
                if (IS_XBAND())
                {
                    XSBandStack_Slave.type = X_BAND_TRNSM_GET_TYPE_FULL_REPORT;
                }
                else
                {
                    XSBandStack_Slave.type = S_X_BAND_TRNSM_GET_TYPE_SIMPLE_REPORT;
                }
                XSBandStack_Slave.retries      = S_X_BAND_TRNSM_CMD_RETRY;
                XSBandStack_Slave.state        = S_X_BAND_TRNSM_CMD_STATE_CMD;
                S_X_BAND_TRNSM_FW_Update_State = S_X_BAND_TRNSM_FW_Update_State_REPORT2;
                retStat                        = 0x00;
            }
            else
            {
                // Failed to send the command
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    stackEntry->state   = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                    return S_X_BAND_TRNSM_PARAMS_COMM_ERR;
                }
                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, &XSBandStack_Slave);
            }
            break;
        case S_X_BAND_TRNSM_FW_Update_State_REPORT2:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Do da dew
            retStat = S_X_BAND_TRNSM_CMD_GET_Param(&XSBandStack_Slave);
            if (!retStat && XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
            {
                XSBandStack_Slave.state        = S_X_BAND_TRNSM_CMD_STATE_CMD;
                S_X_BAND_TRNSM_FW_Update_State = S_X_BAND_TRNSM_FW_Update_State_DELAY;
                XSBandStack_Slave.timestamp    = xTaskGetTickCount();
                XSBandStack_Slave.minDelay     = 500;
                if (IS_XBAND())
                {
                    memcpy(&FullReportData_Temp[1], XSBandStack_Slave.ESTTC_data, XSBandStack_Slave.ESTTC_data_size);
                    // Check the FW version
                    if (FullReportData_Temp[0].FW_Version != FullReportData_Temp[1].FW_Version)
                    {
                        return S_X_BAND_TRNSM_FW_UPDATE_OK;
                    }
                    else
                    {
                        return S_X_BAND_TRNSM_FW_UPDATE_UPDATE_FAILD;
                    }
                }
                else
                {
                    memcpy(&SimpleReportData_Temp[1], XSBandStack_Slave.ESTTC_data, XSBandStack_Slave.ESTTC_data_size);
                    // Check the FW version
                    if (SimpleReportData_Temp[0].FW_Version != SimpleReportData_Temp[1].FW_Version)
                    {
                        return S_X_BAND_TRNSM_FW_UPDATE_OK;
                    }
                    else
                    {
                        return S_X_BAND_TRNSM_FW_UPDATE_UPDATE_FAILD;
                    }
                }
            }
            break;
        case S_X_BAND_TRNSM_FW_Update_State_DELAY:
            // Check whether the protocol delay has passed
            if (XSBandStack_Slave.minDelay > (xTaskGetTickCount() - XSBandStack_Slave.timestamp))
            {
                break;
            }

            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
            return 0x00;
    }
    // Retry on error
    if ((0x00 != retStat) || !XSBandStack_Slave.retries)
    {
        DECR_IF_NONZERO(stackEntry->retries);
        memset(FullReportData_Temp, 0x00, sizeof(FullReportData_Temp));
        memset(SimpleReportData_Temp, 0x00, sizeof(SimpleReportData_Temp));
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        XSBandStack_Slave.retries      = S_X_BAND_TRNSM_CMD_RETRY;
        XSBandStack_Slave.command      = S_X_BAND_TRNSM_CMD_DIR_F;
        XSBandStack_Slave.type         = S_X_BAND_TRNSM_NULL_TYPE;
        S_X_BAND_TRNSM_FW_Update_State = S_X_BAND_TRNSM_FW_Update_State_DIR;
        XSBandStack_Slave.parentEntry  = stackEntry;
        return 0x00;
    }
    else if (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
    {
        if (S_X_BAND_TRNSM_FW_Update_State++ == S_X_BAND_TRNSM_FW_Update_State_DELAY)
        {
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
            return retStat;
        }
        XSBandStack_Slave.retries = S_X_BAND_TRNSM_CMD_RETRY;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Prepare S-Band transmitter to be turned off using the power supply
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_ChangeMode_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_ShutDownMode(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t retStat = 0x00;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            stackEntry->timestamp = xTaskGetTickCount();
            retStat               = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, 0, 0);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Copy a file from the SD card of the X-Band Transmitter to the SD card of the OBC
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            uint8_t:
*                      + X_BAND_TRNSM_STAT_WRONG_PARAM - file not found
*                      + X_BAND_TRNSM_DellStatus_enum  - delete Error
* @note              if such a file is already existing it will be overwritten
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_DownloadFileFromSBandTrnsm(S_X_BAND_CMD_StackEntry *stackEntry)
{
    typedef enum X_BAND_TRNSM_DownloadFromXSBand_State_t
    {
        S_X_BAND_TRNSM_DownloadFromXSBand_State_OPENFILE = 0x00,
        S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE,
        S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE_GETRESULT
    } S_X_BAND_TRNSM_DownloadFromXSBand_State_t;

    volatile uint8_t                                 retStat = 0x00;
    uint16_t                                         RxDataLength;
    S_X_BAND_TRNSM_ReadFile_struct                   FileDataBuffer, FileDataBufferTmp;
    static S_X_BAND_TRNSM_DownloadFromXSBand_State_t S_X_BAND_TRNSM_DownloadFromXSBand_State;
    static fm_file_obj_t                             S_X_BAND_TRNSM_DownloadFromXSBand_file_descr;
    static uint32_t                                  S_X_BAND_TRNSM_DownloadFromXSBand_PacketNumber, S_X_BAND_TRNSM_DownloadFromXSBand_FPos;
    static timer_handle_t                            profile_timer;
    static uint32_t                                  rx_len;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        ES_TRACE_DEBUG("X_BAND_TRNSM_DownloadFileFromSBandTrnsm() FINISHED ERR, time =  %d\r\n", (int)xTaskGetTickCount());
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
            ES_TRACE_DEBUG("ERROR\n");
        }
        return retStat;
    }
    // Start the complex command sequence
    if (stackEntry->expectSlaveCommand)
    {
        ES_TRACE_DEBUG("X_BAND_TRNSM_DownloadFileFromSBandTrnsm() START time =  %d\r\n", (int)xTaskGetTickCount());
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        memset(&FileDataBuffer, 0x00, sizeof(FileDataBuffer));
        XSBandStack_Slave.expectSlaveCommand = stackEntry->expectSlaveCommand = 0;
        XSBandStack_Slave.command                                             = S_X_BAND_TRNSM_CMD_OPEN_F;
        XSBandStack_Slave.type                                                = S_X_BAND_TRNSM_NULL_TYPE;
        XSBandStack_Slave.fileHandler                                         = -1;
        S_X_BAND_TRNSM_DownloadFromXSBand_State                               = S_X_BAND_TRNSM_DownloadFromXSBand_State_OPENFILE;
        // timing is very critical here depending on SXBand type
        // (using lower times for SBand may lead to every second command request failing with BUSY status,
        //  while using higher times for XBand leads to NCE (No Command For Execution) error which means the
        // request timed out before getting the results
        XSBandStack_Slave.minDelay    = IS_XBAND() ? XBAND_OPEN_FILE_DELAY_MS : SBAND_OPEN_FILE_DELAY_MS;
        XSBandStack_Slave.parentEntry = stackEntry;
        ES_TRACE_DEBUG("Download START\n");
    }

