J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
    ES_TRACE_DEBUG("Download State = %d (retries: %d)\n", S_X_BAND_TRNSM_DownloadFromXSBand_State, stackEntry->retries);

    // Check the global state of the complex command
    switch (S_X_BAND_TRNSM_DownloadFromXSBand_State)
    {
        case S_X_BAND_TRNSM_DownloadFromXSBand_State_OPENFILE:
            retStat = S_X_BAND_TRNSM_OpenFile(&XSBandStack_Slave);
            if ((!retStat) && (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED))
            {
                if ((XSBandStack_Slave.fileHandler != -1) || (XSBandStack_Slave.fileSize > 0U))
                {
                    fm_result_t fr = fm_open(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr, (char *)stackEntry->ESTTC_data, FM_MODE_READ | FM_MODE_WRITE | FM_MODE_CREATE_ALWAYS);
                    retStat        = fr;
                    if (fr != FM_RES_OK)
                    {
                        // on disk error - try to reinitialise the SD card
                        if ((fr == FM_RES_DISK_ERR) || (fr == FM_RES_LOCKED))
                        {
                            ES_TRACE_DEBUG("X_BAND_TRNSM_DownloadFileFromSBandTrnsm() SD card. ERR = %d\r\n", fr);
                        }
                        // Close the file - regardless if the copy procedure is successful or not
                        fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                    }
                    else
                    {
                        timer_start(&profile_timer);
                        rx_len = 0;

                        XSBandStack_Slave.retries                      = stackEntry->retries;
                        XSBandStack_Slave.state                        = S_X_BAND_TRNSM_CMD_STATE_CMD;
                        S_X_BAND_TRNSM_DownloadFromXSBand_State        = S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE;
                        S_X_BAND_TRNSM_DownloadFromXSBand_PacketNumber = S_X_BAND_TRNSM_DownloadFromXSBand_FPos = 0;
                    }
                }
                else
                {
                    retStat = 0xFA;
                }
            }
            break;
        case S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE:
            if (S_X_BAND_TRNSM_DownloadFromXSBand_FPos >= XSBandStack_Slave.fileSize)
            {
                if (S_X_BAND_TRNSM_DownloadFromXSBand_FPos == XSBandStack_Slave.fileSize)
                {
                    retStat = 0x00;
                }
                else
                {
                    retStat = 0x01;
                }
                fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                S_X_BAND_TRNSM_DownloadFromXSBand_State = S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE_GETRESULT;
                XSBandStack_Slave.state                 = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
            }
            else
            {
                retStat = S_X_BAND_TRNSM_SendCMD(XSBandStack_Slave.devID, S_X_BAND_TRNSM_CMD_READ_F, S_X_BAND_TRNSM_NULL_TYPE, (uint8_t *)&XSBandStack_Slave.fileHandler, sizeof(XSBandStack_Slave.fileHandler));
                if (S_X_BAND_TRNSM_STAT_ACK == retStat)
                {
                    XSBandStack_Slave.minDelay  = 1;
                    XSBandStack_Slave.timestamp = stackEntry->timestamp = xTaskGetTickCount();
                    XSBandStack_Slave.command                           = S_X_BAND_TRNSM_CMD_READ_F;
                    XSBandStack_Slave.type                              = S_X_BAND_TRNSM_NULL_TYPE;
                    XSBandStack_Slave.retries                           = stackEntry->retries;
                    XSBandStack_Slave.state                             = S_X_BAND_TRNSM_CMD_STATE_CMD;
                    S_X_BAND_TRNSM_DownloadFromXSBand_State             = S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE_GETRESULT;
                    retStat                                             = 0x00;
                }
                else
                {
                    // Failed to send the command
                    if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                    {
                        stackEntry->retries = 0;
                        stackEntry->state   = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        return S_X_BAND_TRNSM_PARAMS_COMM_ERR;
                    }
                    S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, &XSBandStack_Slave);
                }
            }
            break;
        case S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE_GETRESULT:
            // Check whether the protocol delay has passed
            if (XSBandStack_Slave.minDelay > (xTaskGetTickCount() - XSBandStack_Slave.timestamp))
            {
                break;
            }
            XSBandStack_Slave.timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(XSBandStack_Slave.devID, S_X_BAND_TRNSM_CMD_READ_F, S_X_BAND_TRNSM_NULL_TYPE, &FileDataBuffer.Status, &RxDataLength);
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                retStat = S_X_BAND_TRNSM_SEND_CARD_ERR;
                // Verify the answer
                if (RxDataLength > 0)
                {
                    if (FileDataBuffer.PacketNumber == S_X_BAND_TRNSM_DownloadFromXSBand_PacketNumber)
                    {
                        // Get the status of the request
                        retStat = FileDataBuffer.Status;
                        // If the status is "OK"
                        if (!retStat)
                        {
                            fm_result_t fr = fm_seek(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr, S_X_BAND_TRNSM_DownloadFromXSBand_FPos);
                            if (fr == FM_RES_OK)
                            {
                                uint32_t NumberReadBytes;

                                // Read a piece of file in the OBC
                                fr = fm_write(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr, &FileDataBuffer.Data, FileDataBuffer.Length, &NumberReadBytes);
                                if ((fr != FM_RES_OK) || (FileDataBuffer.Length != NumberReadBytes))
                                {
                                    // Wrong answer
                                    fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                                    fr = fm_open(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr, (char *)stackEntry->ESTTC_data, FM_MODE_READ | FM_MODE_WRITE | FM_MODE_OPEN_EXISTING);
                                    if (fr != FM_RES_OK)
                                    {
                                        retStat = S_X_BAND_TRNSM_SEND_CARD_ERR;
                                        ES_TRACE_DEBUG("\r\n READ_F CMD fm_open(&) error = %d (retry No %d)", fr, stackEntry->retries);
                                    }
                                    else
                                    {
                                        retStat = 0x00;
                                    }
                                    DECR_IF_NONZERO(stackEntry->retries);
                                }
                                else
                                {
                                    rx_len += FileDataBuffer.Length;

                                    float elapsed_time_sec            = timer_get_elapsed_time(&profile_timer) / 1000.;
                                    float download_rate_bytes_per_sec = rx_len / elapsed_time_sec;
                                    float eta_min                     = ((XSBandStack_Slave.fileSize - rx_len) / download_rate_bytes_per_sec) / 60.;

                                    ES_TRACE_DEBUG("[%ld sec @ %.2f Bps] sxband-download: %ld/%ld bytes transferred [%.2f%%] (ETA: %.2f min)\r\n", (uint32_t)elapsed_time_sec, download_rate_bytes_per_sec, rx_len, XSBandStack_Slave.fileSize, (rx_len * 100.) / XSBandStack_Slave.fileSize, eta_min);

                                    S_X_BAND_TRNSM_DownloadFromXSBand_PacketNumber++;
                                    S_X_BAND_TRNSM_DownloadFromXSBand_FPos += FileDataBuffer.Length;
                                    // Update the state
                                    S_X_BAND_TRNSM_DownloadFromXSBand_State = S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE;
                                    XSBandStack_Slave.state                 = S_X_BAND_TRNSM_CMD_STATE_CMD;
                                    XSBandStack_Slave.retries               = stackEntry->retries;
                                    memcpy(&FileDataBufferTmp, &FileDataBuffer, sizeof(FileDataBuffer));
                                }
                            }
                            else
                            {
                                fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                                fr = fm_open(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr, (char *)stackEntry->ESTTC_data, FM_MODE_READ | FM_MODE_WRITE | FM_MODE_OPEN_EXISTING);
                                if (fr != FM_RES_OK)
                                {
                                    retStat = S_X_BAND_TRNSM_SEND_CARD_ERR;
                                    ES_TRACE_DEBUG("\r\n READ_F CMD fm_open(&) error = %d (retry No %d)", fr, stackEntry->retries);
                                }
                                else
                                {
                                    retStat = 0x00;
                                }
                            }
                        }
                        else
                        {
                            fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                            retStat = 0xF3;
                            // Wrong answer
                        }
                    }
                    else
                    {
                        fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                        retStat = 0xF4;
                        // Wrong answer
                    }
                }
                else
                {
                    fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                    retStat = 0xF5;
                    // Wrong answer
                }
            }
            else
            {
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
                else
                {
                    fm_close(&S_X_BAND_TRNSM_DownloadFromXSBand_file_descr);
                    retStat = 0xF6;
                }
                // Failed to send the command
            }
            break;
    }
    // Retry on error
    if (retStat || (0U == XSBandStack_Slave.retries))
    {
        timer_stop(&profile_timer);
        ES_TRACE_DEBUG("\r\n <DOWNLOAD> Error on state = %d", S_X_BAND_TRNSM_DownloadFromXSBand_State);
        ES_TRACE_DEBUG("\r\n <DOWNLOAD> Retrying on retStat = %d (retry No %d) (local retry %d)", retStat, stackEntry->retries - 1, XSBandStack_Slave.retries);
        DECR_IF_NONZERO(stackEntry->retries);
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        XSBandStack_Slave.retries               = stackEntry->retries;
        XSBandStack_Slave.command               = S_X_BAND_TRNSM_CMD_OPEN_F;
        XSBandStack_Slave.type                  = S_X_BAND_TRNSM_NULL_TYPE;
        XSBandStack_Slave.fileHandler           = -1;
        S_X_BAND_TRNSM_DownloadFromXSBand_State = S_X_BAND_TRNSM_DownloadFromXSBand_State_OPENFILE;
        XSBandStack_Slave.parentEntry           = stackEntry;
        return 0x00;
    }
    else if (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
    {
        if (S_X_BAND_TRNSM_DownloadFromXSBand_State == S_X_BAND_TRNSM_DownloadFromXSBand_State_READFILE_GETRESULT)
        {
            ES_TRACE_DEBUG("X_BAND_TRNSM_DownloadFileFromSBandTrnsm() FINISHED OK, time =  %d\r\n", (int)xTaskGetTickCount());
            timer_stop(&profile_timer);
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
            ES_TRACE_DEBUG("Download SUCCESS\n");
            return retStat;
        }
        XSBandStack_Slave.retries = stackEntry->retries;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Copy a file from the SD card of the OBC to the SD card of the S-Band Transmitter
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            uint8_t:
*                      + X_BAND_TRNSM_STAT_WRONG_PARAM - file not found
*                      + X_BAND_TRNSM_DellStatus_enum  - delete Error
* @note              if such a file is already existing it will be overwritten
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_UploadFileToSBandTrnsm(S_X_BAND_CMD_StackEntry *stackEntry)
{
    typedef enum S_X_BAND_TRNSM_UploadToXSBand_State_t
    {
        S_X_BAND_TRNSM_UploadToXSBand_State_OPEN_FILE = 0x00,
        S_X_BAND_TRNSM_UploadToXSBand_State_DEL_FILE,
        S_X_BAND_TRNSM_UploadToXSBand_State_CREATEFILE,
        S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE,
        S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE_GETRESULT
    } S_X_BAND_TRNSM_UploadToXSBand_State_t;

