J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
    uint8_t                                      retStat = 0x00;
    uint16_t                                     RxDataLength;
    uint32_t                                     S_X_BAND_TRNSM_UploadToXSBand_ReadLen;
    static uint32_t                              tx_len = 0U;
    static timer_handle_t                        profile_timer;
    static timer_handle_t                        cmd_timer;
    static crypto_stream_hnd_t                   crypto_hnd;
    crypto_api_res_t                             crypto_res;
    static S_X_BAND_TRNSM_UploadToXSBand_State_t S_X_BAND_TRNSM_UploadToXSBand_State;
    static S_X_BAND_TRNSM_WriteFile_struct       S_X_BAND_TRNSM_FileDataBuffer;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        ES_TRACE_DEBUG("S_X_BAND_TRNSM_UploadFileToSBandTrnsm() FINISHED tick =  %d\r\n", (int)xTaskGetTickCount());
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Start the complex command sequence
    if (stackEntry->expectSlaveCommand)
    {
        ES_TRACE_DEBUG("X_BAND_TRNSM_UploadFileToSBandTrnsm() START tick =  %d\r\n", (int)xTaskGetTickCount());
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        XSBandStack_Slave.expectSlaveCommand = stackEntry->expectSlaveCommand = 0;
        XSBandStack_Slave.command                                             = S_X_BAND_TRNSM_CMD_DELL_F;
        XSBandStack_Slave.type                                                = S_X_BAND_TRNSM_NULL_TYPE;
        XSBandStack_Slave.fileHandler                                         = -1;
        S_X_BAND_TRNSM_UploadToXSBand_State                                   = S_X_BAND_TRNSM_UploadToXSBand_State_OPEN_FILE;
        XSBandStack_Slave.parentEntry                                         = stackEntry;
    }
    // Check the global state of the complex command
    switch (S_X_BAND_TRNSM_UploadToXSBand_State)
    {
        case S_X_BAND_TRNSM_UploadToXSBand_State_OPEN_FILE:
            crypto_res = crypto_stream_open_always(&crypto_hnd, (char *)stackEntry->obc_file_name, OP_CMOX_AES_GCM_ENC);
            tx_len     = 0U;
            timer_start(&profile_timer);

            if (crypto_res != CRYPTO_API_RES_OK)
            {
                ES_TRACE_DEBUG("X_BAND_TRNSM_UploadFileToSBandTrnsm() Error crypto_stream_open_always(). ERR = %d\r\n", crypto_res);

                retStat = 0x01;
                break;
            }

            XSBandStack_Slave.retries           = stackEntry->retries;
            S_X_BAND_TRNSM_UploadToXSBand_State = S_X_BAND_TRNSM_UploadToXSBand_State_DEL_FILE;
            XSBandStack_Slave.minDelay          = IS_XBAND() ? XBAND_DEL_FILE_DELAY_MS : SBAND_DEL_FILE_DELAY_MS;

            break;

        case S_X_BAND_TRNSM_UploadToXSBand_State_DEL_FILE:
            retStat = S_X_BAND_TRNSM_DelFile(&XSBandStack_Slave);
            if (((0x00 == retStat) || (retStat == S_X_BAND_TRNSM_DELL_NOT_FOUND)) &&
                (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED))
            {
                retStat                             = 0x00;
                XSBandStack_Slave.command           = S_X_BAND_TRNSM_CMD_CREATE_F;
                XSBandStack_Slave.type              = S_X_BAND_TRNSM_NULL_TYPE;
                XSBandStack_Slave.retries           = stackEntry->retries;
                XSBandStack_Slave.state             = S_X_BAND_TRNSM_CMD_STATE_CMD;
                S_X_BAND_TRNSM_UploadToXSBand_State = S_X_BAND_TRNSM_UploadToXSBand_State_CREATEFILE;
            }
            else if (retStat)
            {
                ES_TRACE_DEBUG("\r\n S_X_BAND_TRNSM_UploadToXSBand_State_DEL_FILE ERROR = %d (retry No %d) (local retry %d)", retStat, stackEntry->retries - 1, XSBandStack_Slave.retries);
            }
            break;

        case S_X_BAND_TRNSM_UploadToXSBand_State_CREATEFILE:
            crypto_res = crypto_stream_get_size(&crypto_hnd, &XSBandStack_Slave.fileSize);

            if (crypto_res != CRYPTO_API_RES_OK)
            {
                retStat = 0x03;
                break;
            }

            retStat = S_X_BAND_TRNSM_CreateFile(&XSBandStack_Slave);
            if ((0x00 == retStat) && (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED))
            {
                XSBandStack_Slave.retries           = stackEntry->retries;
                XSBandStack_Slave.state             = S_X_BAND_TRNSM_CMD_STATE_CMD;
                S_X_BAND_TRNSM_UploadToXSBand_State = S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE;
                memset(&S_X_BAND_TRNSM_FileDataBuffer, 0x00, sizeof(S_X_BAND_TRNSM_FileDataBuffer));
                S_X_BAND_TRNSM_FileDataBuffer.FileHandler = XSBandStack_Slave.fileHandler;

                ES_TRACE_DEBUG("sxband-upload: SXBand file handle: %ld\r\n", S_X_BAND_TRNSM_FileDataBuffer.FileHandler);
            }
            else if ((0x00 != retStat) && (XSBandStack_Slave.fileHandler == -1))
            {
                ES_TRACE_DEBUG("\r\n S_X_BAND_TRNSM_UploadToXSBand_State_CREATEFILE ERROR = %d (retry No %d) (local retry %d)", retStat, stackEntry->retries - 1, XSBandStack_Slave.retries);
                retStat = 0x03;
            }
            break;

        case S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE:
            S_X_BAND_TRNSM_FileDataBuffer.Size = S_X_BAND_TRNSM_READ_FILE_CHUNCK_SIZE;

            // Set the cursor to the end of the file
            crypto_res = crypto_stream_read(&crypto_hnd, S_X_BAND_TRNSM_FileDataBuffer.Data, S_X_BAND_TRNSM_FileDataBuffer.Size, &S_X_BAND_TRNSM_UploadToXSBand_ReadLen);

            if ((S_X_BAND_TRNSM_UploadToXSBand_ReadLen > 0) && ((crypto_res == CRYPTO_API_RES_EOS) || (crypto_res == CRYPTO_API_RES_OK)))
            {
                S_X_BAND_TRNSM_FileDataBuffer.Size = S_X_BAND_TRNSM_UploadToXSBand_ReadLen;

                const uint8_t *p_write_file_hdr_start = (uint8_t *)&S_X_BAND_TRNSM_FileDataBuffer.Size; // point to the first field of the header
                // size includes the header size + currently read data from the stream
                const uint16_t write_file_cmd_size = sizeof(S_X_BAND_TRNSM_FileDataBuffer.Size) +
                                                     sizeof(S_X_BAND_TRNSM_FileDataBuffer.FileHandler) +
                                                     sizeof(S_X_BAND_TRNSM_FileDataBuffer.PacketNumber) +
                                                     S_X_BAND_TRNSM_UploadToXSBand_ReadLen;

