J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
                retStat = S_X_BAND_TRNSM_SendCMD(XSBandStack_Slave.devID, S_X_BAND_TRNSM_CMD_WRITE_F, S_X_BAND_TRNSM_NULL_TYPE, p_write_file_hdr_start, (uint16_t)write_file_cmd_size);

                if (S_X_BAND_TRNSM_STAT_ACK == retStat)
                {
                    ES_TRACE_DEBUG("sxband-upload: %ld bytes ACK'd @ file handle: %ld\r\n", write_file_cmd_size, S_X_BAND_TRNSM_FileDataBuffer.FileHandler);

                    XSBandStack_Slave.minDelay  = 2;
                    XSBandStack_Slave.timestamp = stackEntry->timestamp = xTaskGetTickCount();
                    XSBandStack_Slave.command                           = S_X_BAND_TRNSM_CMD_WRITE_F;
                    XSBandStack_Slave.type                              = S_X_BAND_TRNSM_NULL_TYPE;
                    XSBandStack_Slave.retries                           = stackEntry->retries;
                    XSBandStack_Slave.state                             = S_X_BAND_TRNSM_CMD_STATE_CMD;
                    S_X_BAND_TRNSM_UploadToXSBand_State                 = S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE_GETRESULT;
                    retStat                                             = 0x00;
                }
                else
                {
                    if (retStat)
                    {
                        ES_TRACE_DEBUG("\r\n WRITE_F CMD ERROR = %d (retry No %d)", retStat, stackEntry->retries);
                    }
                    // Failed to send the command
                    if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                    {
                        stackEntry->retries = 0;
                        stackEntry->state   = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        return S_X_BAND_TRNSM_PARAMS_COMM_ERR;
                    }
                    S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, &XSBandStack_Slave);
                }

                timer_start(&cmd_timer);
            }

            if (crypto_res == CRYPTO_API_RES_EOS)
            {
                retStat = 0x00;

                S_X_BAND_TRNSM_UploadToXSBand_State = S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE_GETRESULT;
                XSBandStack_Slave.state             = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
            }
            break;

        case S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE_GETRESULT:
            // Check whether the protocol delay has passed
            if (XSBandStack_Slave.minDelay > (xTaskGetTickCount() - XSBandStack_Slave.timestamp))
            {
                break;
            }

            XSBandStack_Slave.timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(XSBandStack_Slave.devID, S_X_BAND_TRNSM_CMD_WRITE_F, S_X_BAND_TRNSM_NULL_TYPE, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);

            if (IS_TRUE(cmd_timer.is_running))
            {
                ES_TRACE_DEBUG("[WRITE-GETRES delta] => %ld\r\n", timer_get_elapsed_time(&cmd_timer));
                timer_stop(&cmd_timer);
            }

            ES_TRACE_DEBUG("GetResult ==> retStat = %d | op_res = %d | len = %ld\r\n", retStat, S_X_BAND_TRNSM_Result_Rx_Buffer[0], RxDataLength);

            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (RxDataLength == sizeof(retStat))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if (0x00 == retStat)
                    {
                        // On success move to the next packet
                        S_X_BAND_TRNSM_FileDataBuffer.PacketNumber++;
                        tx_len += S_X_BAND_TRNSM_FileDataBuffer.Size;

                        float elapsed_time_sec          = timer_get_elapsed_time(&profile_timer) / 1000.;
                        float upload_rate_bytes_per_sec = tx_len / elapsed_time_sec;
                        float eta_min                   = ((XSBandStack_Slave.fileSize - tx_len) / upload_rate_bytes_per_sec) / 60.;

                        ES_TRACE_DEBUG("[%ld sec @ %.2f Bps] sxband-upload: %ld/%ld bytes transferred [%.2f%%] (ETA: %.2f min)\r\n", (uint32_t)elapsed_time_sec, upload_rate_bytes_per_sec, tx_len, XSBandStack_Slave.fileSize, (tx_len * 100.) / XSBandStack_Slave.fileSize, eta_min);

                        // Update the state
                        S_X_BAND_TRNSM_UploadToXSBand_State = S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE;
                        XSBandStack_Slave.state             = S_X_BAND_TRNSM_CMD_STATE_CMD;
                        XSBandStack_Slave.retries           = stackEntry->retries;
                    }
                    else
                    {
                        retStat = 0xF3;
                        // Wrong answer
                    }
                }
                else
                {
                    retStat = 0xF5;
                    // Wrong answer
                }
            }
            else
            {
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
                else
                {
                    if (retStat)
                    {
                        ES_TRACE_DEBUG("\r\n WRITE_F GETRESULT LOCAL ERR = %d (retry No %d)", retStat, XSBandStack_Slave.retries);
                    }
                    retStat = 0xF6;
                }
                // Failed to send the command
            }
            if (retStat)
            {
                ES_TRACE_DEBUG("\r\n WRITE_F GETRESULT ERROR = %d (retry No %d)", retStat, stackEntry->retries);
            }
            break;
    }
    // Retry on error
    if ((0x00 != retStat) || (!XSBandStack_Slave.retries))
    {
        ES_TRACE_DEBUG("\r\n Error on state = %d", S_X_BAND_TRNSM_UploadToXSBand_State);
        ES_TRACE_DEBUG("\r\n Retrying on retStat = %d (retry No %d) (local retry %d)", retStat, stackEntry->retries - 1, XSBandStack_Slave.retries);
        retStat = 0x00;
        DECR_IF_NONZERO(stackEntry->retries);
        memcpy(&XSBandStack_Slave, stackEntry, sizeof(S_X_BAND_CMD_StackEntry));
        XSBandStack_Slave.retries           = stackEntry->retries;
        XSBandStack_Slave.command           = S_X_BAND_TRNSM_CMD_DELL_F;
        XSBandStack_Slave.type              = S_X_BAND_TRNSM_NULL_TYPE;
        XSBandStack_Slave.fileHandler       = -1;
        S_X_BAND_TRNSM_UploadToXSBand_State = S_X_BAND_TRNSM_UploadToXSBand_State_OPEN_FILE;
        XSBandStack_Slave.parentEntry       = stackEntry;
        timer_stop(&profile_timer);

