J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
        crypto_stream_close(&crypto_hnd);

        return retStat;
    }
    else if (XSBandStack_Slave.state == S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
    {
        if (S_X_BAND_TRNSM_UploadToXSBand_State == S_X_BAND_TRNSM_UploadToXSBand_State_WRITEFILE_GETRESULT)
        {
            ES_TRACE_DEBUG("S_X_BAND_TRNSM_UploadFileToSBandTrnsm() FINISHED OK, time =  %.2f min\r\n", (timer_get_elapsed_time(&profile_timer) / 1000.) / 60.);

            // make sure the file cache is invalidated when an upload operation to SXBand finishes
            moduleCacheInfo.file_cache_valid = false;

            timer_stop(&profile_timer);
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;

            crypto_stream_close(&crypto_hnd);

            return retStat;
        }
        XSBandStack_Slave.retries = stackEntry->retries;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief A Task that serves commands through ESTTC protocol
*********************************************************************************************
* @param[input]      argument - unused, a template is followed
* @param[output]     none
* @return            none
*********************************************************************************************
*/

void S_X_BAND_Task(void *argument)
{
    uint8_t i;
    bool    stack_empty;

    (void)argument;

    task_mon_task_initialized(TASK_ID_S_X_BAND);

    for (;;)
    {
        (void)osMutexAcquire(sxband_lock_id, osWaitForever);

        task_mon_i_am_alive(TASK_ID_S_X_BAND);

        stack_empty = true;
        // Process with the state machine
        for (i = 0; i < S_X_BAND_STACK_SIZE; ++i)
        {
            // Empty slot - continue
            if ((XSBandStack[i].state != S_X_BAND_TRNSM_CMD_STATE_EMPTY) && (XSBandStack[i].state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED))
            {
                stack_empty = false;
                // Processing state - process the data and induce a new state if needed
                if ((XSBandStack[i].command < S_X_BAND_TRNSM_CMD_NUMBER) &&
                    (NULL != XSBandCallbacks[XSBandStack[i].command]))
                {
                    XSBandTryFinish(XSBandCallbacks[XSBandStack[i].command](&XSBandStack[i]), &XSBandStack[i]);
                }
                else
                {
                    sx_band_init_stack(&XSBandStack[i]);
                }

                break;
            }
        }

        if ((stack_empty) && (NULL != cacheUpdateThread))
        {
            // signal cache update when there are no commands in the stack anymore (just in case it is pending for execution)
            (void)osThreadFlagsSet(cacheUpdateThread, UNBLOCK_CACHE_THREAD_FLAG);
        }

        (void)osMutexRelease(sxband_lock_id);

        // Check if all the stack was empty
        if (stack_empty)
        {
            osDelay(200);
        }
        else
        {
            osDelay(1);
        }

        task_mon_low_stack_check(TASK_ID_S_X_BAND);
    }
}

/*!
*********************************************************************************************
* @brief Request a command from ESTTC gateway
*********************************************************************************************
* @param[input]      Identifier - SXBand module identifier to send the command to
* @param[input]      Cmd - Command number that is requested to be executed
*                     - 0x01    Symbol Rate
*                     - 0x02    Tx Power
*                     - 0x03    Central Frequency
*                     - 0x04    MODCOD
*                     - 0x05    Roll-Off
*                     - 0x06    Pilot Signal On/Off
*                     - 0x07    FEC Frame size
*                     - 0x08    Pretransmission Staffing Delay
*                     - 0x09    Change All Parameters
*                     - 0x0A    Simple Report
*                     - 0x0B    Full Report
*                     - 0x0C    Change Baudrate
*                     - 0x30    TxMode
*                     - 0x31    Load Mode
*                     - 0x32    Prepare to ShutDown
*                     - 0x35    FW update
*                     - 0x40    Dir
*                     - 0x50    Delete
*                     - 0x55    Delete all
*                     - 0x60    Upload a file
*                     - 0x61    Download a file
*                     - 0x70    Send a file
* @param[input]      Type - accepts only: 'R' - Read command, 'W' - Write commands
* @param[input]      size - size of the input data if used (if pData == NULL, this parameter is ignored)
* @param[input]      pData - pointer to the input data (if not needed set to NULL. This can be settings, file name etc.)
* @param[input]      pOnCmdResponse - pointer to a user-defined callback which receives the result from the command
* @param[output]     p_cmd_eta_ms - milliseconds to wait for the command to finish
* @return            none
*********************************************************************************************
*/
void S_X_BAND_TRNSM_ESTTC_StartCmd(uint16_t Identifier, S_X_BAND_TRNSM_GW_CMD_ID_enum Cmd, uint8_t Type, uint8_t size, const uint8_t *pData, sUserResponseCtx_t *pUserRespCtx, uint32_t *const p_cmd_eta_ms)
{
    uint8_t i;

    // Check if any command is currently in progress
    // Should we add a new command to the stack ???
    // First, check whether this is attempted consecutive file commands execution
    bool is_file_cmd         = ((uint8_t)Cmd >= S_X_BAND_TRNSM_GW_CMD_ID_FW_UPDATE) && ((uint8_t)Cmd <= S_X_BAND_TRNSM_GW_CMD_ID_SEND_FILES);
    bool accept_startcmd_req = true;

    (void)osMutexAcquire(sxband_lock_id, osWaitForever);

#if S_X_BAND_STACK_SAFETY
    for (i = 0; i < S_X_BAND_STACK_SIZE; ++i)
    {
        if (XSBandStack[i].state != S_X_BAND_TRNSM_CMD_STATE_EMPTY)
        {
            if (is_file_cmd && XSBandStack[i].isFileCommand)
            {
#ifdef S_X_BAND_STACK_DEBUG
                for (uint8_t p = 0; p < S_X_BAND_STACK_SIZE; ++p)
                {
                    ES_TRACE_DEBUG("Stack lvl [%d] - STATUS: %d RETR: %d CMD: %d !!!\r\n", p, XSBandStack[p].state, XSBandStack[p].retries, XSBandStack[p].command);
                }
                if (XSBandStack_Slave.parentEntry != NULL)
                {
                    ES_TRACE_DEBUG("Stack lvl [SLAVE] {PARENT: %d} - STATUS: %d RETR: %d CMD: %d !!!\r\n", XSBandStack_Slave.parentEntry->command, XSBandStack_Slave.state, XSBandStack_Slave.retries, XSBandStack_Slave.command);
                }
#endif
                accept_startcmd_req = false;
            }
            else if ((XSBandStack[i].ESTTC_request == Cmd) && (XSBandStack[i].ESTTC_request_type == Type))
            {
#ifdef S_X_BAND_STACK_DEBUG
                for (uint8_t p = 0; p < S_X_BAND_STACK_SIZE; ++p)
                {
                    ES_TRACE_DEBUG("Stack lvl [%d] - STATUS: %d RETR: %d CMD: %d !!!\r\n", p, XSBandStack[p].state, XSBandStack[p].retries, XSBandStack[p].command);
                }
                if (XSBandStack_Slave.parentEntry != NULL)
                {
                    ES_TRACE_DEBUG("Stack lvl [SLAVE] {PARENT: %d} - STATUS: %d RETR: %d CMD: %d !!!\r\n", XSBandStack_Slave.parentEntry->command, XSBandStack_Slave.state, XSBandStack_Slave.retries, XSBandStack_Slave.command);
                }
#endif
                accept_startcmd_req = false;
            }
        }
    }
#endif /* S_X_BAND_STACK_SAFETY */

    if (accept_startcmd_req)
    {

        // before executing the command, attempt a one-time SXBand module type detection because
        // certain commands require different interpretation depending on the module type
        S_X_BAND_TRNSM_Detect_Band_Type(Identifier);

        // attempt to update file cache before executing the queued command
        // (performed only for TX_MODE, DOWNLOAD_FILE and SEND_FILES commands where the local cache is
        // needed to properly calculate the command timeout)
        if ((!moduleCacheInfo.file_cache_valid) &&
            ((S_X_BAND_TRNSM_GW_CMD_ID_TX_MODE == Cmd) ||
             (S_X_BAND_TRNSM_GW_CMD_ID_DOWNLOAD_FILE == Cmd) ||
             (S_X_BAND_TRNSM_GW_CMD_ID_SEND_FILES == Cmd)))
        {
            cacheUpdateThread = osThreadGetId();

            // let the main driver task perform the cache update...
            (void)osMutexRelease(sxband_lock_id);

            // wait for main task to execute all pending command on the stack before
            // going further with the cache command
            (void)osThreadFlagsWait(UNBLOCK_CACHE_THREAD_FLAG,
                                    osFlagsWaitAll,
                                    TX_CMD_TIMEOUT_MS);

            S_X_Band_Update_Module_Cache(Identifier);

            // make sure the thread ID is set to NULL to avoid undesired signaling from S_X_BAND_Task after
            // the cache has been updated (which may potentially unblock the caller of this function since it
            // takes place in the same thread context
            cacheUpdateThread = NULL;

            // ...and lock again to add the current command to the command stack
            (void)osMutexAcquire(sxband_lock_id, osWaitForever);
        }

        // Try to add
        for (i = 0; i < S_X_BAND_STACK_SIZE; ++i)
        {
            if (XSBandStack[i].state == S_X_BAND_TRNSM_CMD_STATE_EMPTY)
            {
                sx_band_init_stack(&XSBandStack[i]);
                XSBandStack[i].devID              = Identifier;
                XSBandStack[i].ESTTC_request      = Cmd;
                XSBandStack[i].isFileCommand      = is_file_cmd;
                XSBandStack[i].obc_file_name[0]   = '\0';
                XSBandStack[i].ESTTC_request_type = Type;

                if ((size > 0) && (NULL != pData))
                {
                    if (true == is_file_cmd)
                    {
                        // extract only file name for use by any file operations with SXBand SD card where folders are not supported
                        file_helper_parse_path((const char *)pData, size, (char *)NULL, 0, (char *)XSBandStack[i].ESTTC_data, (sizeof(XSBandStack[i].ESTTC_data) >= FM_MAX_PATH) ? FM_MAX_PATH : sizeof(XSBandStack[i].ESTTC_data));

                        XSBandStack[i].ESTTC_data_size                            = (uint8_t)strlen((char *)XSBandStack[i].ESTTC_data) + 1;
                        XSBandStack[i].ESTTC_data[XSBandStack[i].ESTTC_data_size] = '\0';

                        // copy the full path for use by local OBC operations with the file
                        //  (e.g. upload operations where you need to open the original file on the OBC SD card)
                        strncpy(XSBandStack[i].obc_file_name, (const char *)pData, (sizeof(XSBandStack[i].obc_file_name) >= size) ? size : sizeof(XSBandStack[i].obc_file_name));
                        XSBandStack[i].obc_file_name[size - 1] = '\0';
                    }
                    else
                    {
                        memcpy(XSBandStack[i].ESTTC_data, pData, size);
                        XSBandStack[i].ESTTC_data_size = size;
                    }
                }

                XSBandStack[i].retries      = S_X_BAND_TRNSM_CMD_RETRY;
                XSBandStack[i].timestamp    = 0;
                XSBandStack[i].minDelay     = S_X_BAND_STACK_DELAY;
                XSBandStack[i].pUserRespCtx = pUserRespCtx;

