J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
                if (CMD_EXTRACT_RESULT_UNSUP_CMD == XSBandExtractCommandAndType(&XSBandStack[i]))
                {
                    USER_COMMIT_FORMATTED_BUF(XSBandStack[i].pUserRespCtx, "Error - Command '0x%02x' not supported by module\r\n", Cmd);
                    memset(&XSBandStack[i], 0x00, sizeof(XSBandStack[i]));
                }
                else
                {
                    if (NULL != p_cmd_eta_ms)
                    {
                        *p_cmd_eta_ms = S_X_Band_Get_Cmd_Timeout(Identifier, Cmd, Type, size, pData);
                    }

                    XSBandStack[i].state = S_X_BAND_TRNSM_CMD_STATE_CMD;
                }

                break;
            }
        }

        if (i == S_X_BAND_STACK_SIZE)
        {
            ES_TRACE_DEBUG("Error - Cannot add command to the stack !!!\r\n");
#ifdef S_X_BAND_STACK_DEBUG
            for (i = 0; i < S_X_BAND_STACK_SIZE; ++i)
            {
                ES_TRACE_DEBUG("Stack lvl [%d] - STATUS: %d RETR: %d CMD: %d !!!\r\n", i, XSBandStack[i].state, XSBandStack[i].retries, XSBandStack[i].command);
            }
            if (XSBandStack_Slave.parentEntry != NULL)
            {
                ES_TRACE_DEBUG("Stack lvl [SLAVE] {PARENT: %d} - STATUS: %d RETR: %d CMD: %d !!!\r\n", XSBandStack_Slave.parentEntry->command, XSBandStack_Slave.state, XSBandStack_Slave.retries, XSBandStack_Slave.command);
            }
#endif
        }
    }
    else
    {
        USER_COMMIT_FORMATTED_BUF(pUserRespCtx, "Error - Cannot execute several commands of the same type simultaneously!\r\n");
    }

    (void)osMutexRelease(sxband_lock_id);
}

/** @brief Called when the Dir List internal cache update command has finished
 *
 *  @param[in] pUserCtx User context data provided initially when the DirList command was queued for execution
 */
static void S_X_Band_On_CacheUpdateReady(void *const pUserCtx)
{
    if (NULL != cacheUpdateThread)
    {
        (void)osThreadFlagsSet(cacheUpdateThread, UNBLOCK_CACHE_THREAD_FLAG);
    }
}

/** @brief The function performs a module parameters update and a dir list command to update the local file index.
 *
 *  @param[in] Identifier id of the SXBand module
 */
static void S_X_Band_Update_Module_Cache(uint16_t Identifier)
{
    if (!moduleCacheInfo.in_progress)
    {
        moduleCacheInfo.in_progress = true;

        if (!moduleCacheInfo.settings_cache_valid)
        {
            uint8_t all_params[13];

            moduleCacheInfo.modcod         = 0;
            moduleCacheInfo.sym_rate       = 0;
            moduleCacheInfo.pretx_delay_ms = 0;

            // try to obtain the Symbol rate, ModCod and other settings which may be needed to properly estimate the ground station
            // downlink timeout
            S_X_BAND_TRNSM_Response_enum cmd_stat = S_X_BAND_TRNSM_SendCMD(Identifier, S_X_BAND_TRNSM_CMD_GET, S_X_BAND_TRNSM_GET_TYPE_ALL_CHANGE_MODE, (uint8_t *)NULL, 0);

            // command was confirmed by the device and CRC checks passed
            if (S_X_BAND_TRNSM_STAT_ACK == cmd_stat)
            {
                uint16_t RxDataLength;

                (void)S_X_BAND_TRNSM_GetResult(Identifier, S_X_BAND_TRNSM_CMD_GET, S_X_BAND_TRNSM_GET_TYPE_ALL_CHANGE_MODE, all_params, &RxDataLength);

                // all_params[0] contains the command status and we want to skip that before casting to S_X_BAND_TRNSM_GET_AllParams_struct *
                moduleCacheInfo.modcod         = ((S_X_BAND_TRNSM_GET_AllParams_struct *)&all_params[1])->MODCOD;
                moduleCacheInfo.sym_rate       = ((S_X_BAND_TRNSM_GET_AllParams_struct *)&all_params[1])->SymbolRate;
                moduleCacheInfo.pretx_delay_ms = ((S_X_BAND_TRNSM_GET_AllParams_struct *)&all_params[1])->PreTxStaffingDelay;

                moduleCacheInfo.settings_cache_valid = true;
            }
        }

        // now get the file list to be aware of the file sizes stored on the SXBand SD card
        static sUserResponseCtx_t user_resp_ctx;

        user_resp_ctx.pUserCtx           = NULL;
        user_resp_ctx.pu8DataBuf         = NULL;
        user_resp_ctx.onCmdResponseReady = &S_X_Band_On_CacheUpdateReady;

        // in order to block the caller of this function (who will reside in a different thread than the SXBand driver thread,
        // we need to obtain the active thread ID for signalling later when the operation is finished)
        cacheUpdateThread = osThreadGetId();

        S_X_BAND_TRNSM_ESTTC_StartCmd(Identifier, S_X_BAND_TRNSM_GW_CMD_ID_DIR_LIST, 'R', 0, NULL, &user_resp_ctx, NULL);

        // just perform a blocking wait until command is over (we don't actually care if a timeout occurred)
        (void)osThreadFlagsWait(UNBLOCK_CACHE_THREAD_FLAG,
                                osFlagsWaitAll,
                                TX_CMD_TIMEOUT_MS);

        user_resp_ctx.pUserCtx           = NULL;
        user_resp_ctx.pu8DataBuf         = NULL;
        user_resp_ctx.onCmdResponseReady = NULL;
        moduleCacheInfo.in_progress      = false;
    }
}

/*
*********************************************************************************************
* INTERNAL (STATIC) ROUTINES DEFINITION
*********************************************************************************************
*/
/*!
*********************************************************************************************
* @brief Fill up the stack according to the command
*********************************************************************************************
* @param[input]      none
* @param[output]     stackEntry - current stack entry
* @return            see S_X_BAND_CMD_EXTRACT_RES description
*********************************************************************************************
*/
static S_X_BAND_CMD_EXTRACT_RES XSBandExtractCommandAndType(S_X_BAND_CMD_StackEntry *stackEntry)
{
    if (stackEntry->ESTTC_request_type == 'R')
    {
        switch (stackEntry->ESTTC_request)
        {
            case S_X_BAND_TRNSM_GW_CMD_ID_SYM_RATE:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_SYMBOL_RATE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_TX_PWR:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_TX_POWER;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_CENT_FREQ:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_CENTRAL_FREQ;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_MODCOD:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_MODCOD;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ROLL_OFF:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_ROLL_OFF;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PILOT:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_PILOT_SIGNAL;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_FEC_FR_SZ:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_FEC_FRAME_SIZE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PRETX_DELAY:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_PRETRASIT_DELAY;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ALL_PARAMS:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_ALL_CHANGE_MODE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_REP_SIMPLE:
                stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                stackEntry->type    = S_X_BAND_TRNSM_GET_TYPE_SIMPLE_REPORT;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_REP_FULL:
                if (IS_XBAND())
                {
                    stackEntry->command = S_X_BAND_TRNSM_CMD_GET;
                    stackEntry->type    = X_BAND_TRNSM_GET_TYPE_FULL_REPORT;
                }
                else
                {
                    return CMD_EXTRACT_RESULT_UNSUP_CMD;
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DIR_LIST:
                stackEntry->command            = S_X_BAND_TRNSM_CMD_DIR_F;
                stackEntry->type               = S_X_BAND_TRNSM_NULL_TYPE;
                stackEntry->expectSlaveCommand = 1;
                stackEntry->minDelay           = 250;
                break;
            default:
                return CMD_EXTRACT_RESULT_UNSUP_CMD;
        }
    }
    else if (stackEntry->ESTTC_request_type == 'W')
    {
        switch (stackEntry->ESTTC_request)
        {
            case S_X_BAND_TRNSM_GW_CMD_ID_SYM_RATE:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_SYMBOL_RATE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_TX_PWR:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_TX_POWER;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_CENT_FREQ:
                {
                    float centralFreq = (stackEntry->ESTTC_data[0] * 1000) + (stackEntry->ESTTC_data[1] * 100) + (stackEntry->ESTTC_data[2] * 10) + stackEntry->ESTTC_data[3];
                    float decPart     = (stackEntry->ESTTC_data[5] * 100) + (stackEntry->ESTTC_data[6] * 10) + stackEntry->ESTTC_data[7];
                    decPart /= 1000;
                    centralFreq += decPart;
                    memcpy(stackEntry->ESTTC_data, &centralFreq, sizeof(centralFreq));
                    stackEntry->ESTTC_data_size = sizeof(centralFreq);
                    stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                    stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_CENTRAL_FREQ;
                    break;
                }
            case S_X_BAND_TRNSM_GW_CMD_ID_MODCOD:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_MODCOD;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ROLL_OFF:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_ROLL_OFF;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PILOT:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_PILOT_SIGNAL;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_FEC_FR_SZ:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_FEC_FRAME_SIZE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PRETX_DELAY:
                {
                    uint16_t preTransDelay = (stackEntry->ESTTC_data[0] * 1000) + (stackEntry->ESTTC_data[1] * 100) + (stackEntry->ESTTC_data[2] * 10) + stackEntry->ESTTC_data[3];
                    memcpy(stackEntry->ESTTC_data, &preTransDelay, sizeof(preTransDelay));
                    stackEntry->ESTTC_data_size = sizeof(uint16_t);
                    stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                    stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_PRETRASIT_DELAY;
                    break;
                }
            case S_X_BAND_TRNSM_GW_CMD_ID_ALL_PARAMS:
                {
                    S_X_BAND_TRNSM_GET_AllParams_struct AllParamsData;
                    AllParamsData.SymbolRate         = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                    AllParamsData.TxPower            = (stackEntry->ESTTC_data[2] * 10) + stackEntry->ESTTC_data[3];
                    AllParamsData.MODCOD             = (stackEntry->ESTTC_data[4] * 10) + stackEntry->ESTTC_data[5];
                    AllParamsData.RollOff            = (stackEntry->ESTTC_data[6] * 10) + stackEntry->ESTTC_data[7];
                    AllParamsData.PilotSignal        = (stackEntry->ESTTC_data[8] * 10) + stackEntry->ESTTC_data[9];
                    AllParamsData.FEC_Frame_Size     = (stackEntry->ESTTC_data[10] * 10) + stackEntry->ESTTC_data[11];
                    AllParamsData.PreTxStaffingDelay = (stackEntry->ESTTC_data[12] * 1000) + (stackEntry->ESTTC_data[13] * 100) + (stackEntry->ESTTC_data[14] * 10) + (stackEntry->ESTTC_data[15] * 1);
                    AllParamsData.CentralFreq        = (stackEntry->ESTTC_data[16] * 1000) + (stackEntry->ESTTC_data[17] * 100) + (stackEntry->ESTTC_data[18] * 10) + (stackEntry->ESTTC_data[19] * 1);
                    float decimal_part               = (stackEntry->ESTTC_data[21] * 100) + (stackEntry->ESTTC_data[22] * 10) + (stackEntry->ESTTC_data[23] * 1);
                    decimal_part                     = decimal_part / 1000;
                    AllParamsData.CentralFreq += decimal_part;
                    memcpy(stackEntry->ESTTC_data, &AllParamsData, sizeof(S_X_BAND_TRNSM_GET_AllParams_struct));
                    stackEntry->ESTTC_data_size = sizeof(S_X_BAND_TRNSM_GET_AllParams_struct);
                    stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                    stackEntry->type            = S_X_BAND_TRNSM_GET_TYPE_ALL_CHANGE_MODE;
                    break;
                }
            case S_X_BAND_TRNSM_GW_CMD_ID_BAUD_RATE:
                stackEntry->ESTTC_data[0]   = (stackEntry->ESTTC_data[0] * 10) + stackEntry->ESTTC_data[1];
                stackEntry->ESTTC_data_size = sizeof(uint8_t);
                stackEntry->command         = S_X_BAND_TRNSM_CMD_SET;
                stackEntry->type            = S_X_BAND_TRNSM_SET_TYPE_BAUDRATE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_TX_MODE:
                stackEntry->command = S_X_BAND_TRNSM_CMD_TX_MODE;
                stackEntry->retries = 300;
                stackEntry->type    = S_X_BAND_TRNSM_NULL_TYPE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_IDLE_MODE:
                stackEntry->command = S_X_BAND_TRNSM_CMD_LOAD_MODE;
                stackEntry->type    = S_X_BAND_TRNSM_NULL_TYPE;
                stackEntry->retries = 300;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_SAFE_SHUTDOWN:
                stackEntry->command  = S_X_BAND_TRNSM_CMD_SAFE_SHUTDOWN;
                stackEntry->type     = S_X_BAND_TRNSM_NULL_TYPE;
                stackEntry->minDelay = 650;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_FW_UPDATE:
                ES_TRACE_DEBUG("Updating ... \r\n");
                stackEntry->command            = S_X_BAND_TRNSM_CMD_UPDATE_FW;
                stackEntry->type               = S_X_BAND_TRNSM_NULL_TYPE;
                stackEntry->expectSlaveCommand = 1;
                stackEntry->minDelay           = 3000;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DEL_FILE:
                // Data implicitly set as string
                stackEntry->command = S_X_BAND_TRNSM_CMD_DELL_F;
                stackEntry->type    = S_X_BAND_TRNSM_NULL_TYPE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DEL_ALL:
                stackEntry->command = S_X_BAND_TRNSM_CMD_DELL_ALL_F;
                stackEntry->type    = S_X_BAND_TRNSM_NULL_TYPE;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_UPLOAD_FILE:
                // Data implicitly set as string
                stackEntry->retries            = 3;
                stackEntry->command            = S_X_BAND_TRNSM_CMD_WRITE_F;
                stackEntry->type               = S_X_BAND_TRNSM_NULL_TYPE;
                stackEntry->expectSlaveCommand = 1;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DOWNLOAD_FILE:
                // Data implicitly set as string
                stackEntry->retries            = 3;
                stackEntry->command            = S_X_BAND_TRNSM_CMD_READ_F;
                stackEntry->type               = S_X_BAND_TRNSM_NULL_TYPE;
                stackEntry->expectSlaveCommand = 1;
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_SEND_FILES:
                // Data implicitly set as string
                stackEntry->minDelay = 50;
                stackEntry->retries  = 6000;
                stackEntry->command  = S_X_BAND_TRNSM_CMD_SEND_F;
                stackEntry->type     = IS_XBAND() ? S_X_BAND_TRNSM_SEND_F_TYPE_PREDIS_AND_RF : S_X_BAND_TRNSM_SEND_F_TYPE_WITH_RF_TRACT;
                break;
            default:
                return CMD_EXTRACT_RESULT_UNSUP_CMD;
        }
    }

    return CMD_EXTRACT_RESULT_VALID_CMD;
}

