J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
/*!
*********************************************************************************************
* @brief A Task that serves commands through ESTTC protocol
*********************************************************************************************
* @param[input]      retRes - execution status
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            none
*********************************************************************************************
*/
static void XSBandTryFinish(uint8_t retRes, S_X_BAND_CMD_StackEntry *stackEntry)
{
    // Exit condition - command hasn't been finished yet
    if ((stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED) && (0x00 == retRes))
    {
        return;
    }
    // Process the stack command result
    if (stackEntry->ESTTC_request_type == 'R')
    {
        switch (stackEntry->ESTTC_request)
        {
            case S_X_BAND_TRNSM_GW_CMD_ID_SYM_RATE:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Symbol Rate = %d \r\n", *stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_TX_PWR:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Tx Power = %d \r\n", *stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_CENT_FREQ:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Central Frequency = %4.3f \r\n", *((float *)stackEntry->ESTTC_data));
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_MODCOD:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "MODCOD = %d \r\n", *stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ROLL_OFF:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Roll-Off = %d \r\n", *stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PILOT:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Pilot Signal = %d \r\n", *stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_FEC_FR_SZ:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "FEC Frame size = %d \r\n", *stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PRETX_DELAY:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Pretransmission Staf Delay = %d \r\n", *((uint16_t *)stackEntry->ESTTC_data));
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ALL_PARAMS:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    S_X_BAND_TRNSM_GET_AllParams_struct *AllParamsData = (S_X_BAND_TRNSM_GET_AllParams_struct *)stackEntry->ESTTC_data;
                    USER_START_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           Symbol Rate = %d \r\n", AllParamsData->SymbolRate);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "              Tx Power = %d \r\n", AllParamsData->TxPower);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                MODCOD = %d \r\n", AllParamsData->MODCOD);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "              Roll Off = %d \r\n", AllParamsData->RollOff);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "          Pilot Signal = %d \r\n", AllParamsData->PilotSignal);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "   Pre. FEC Frame Size = %d \r\n", AllParamsData->FEC_Frame_Size);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "Pre. Tx Staffing delay = %d \r\n", AllParamsData->PreTxStaffingDelay);
                    USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "     Central Frequency = %4.3f \r\n", AllParamsData->CentralFreq);
                    USER_COMMIT_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_REP_SIMPLE:
                if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                {
                    if (IS_XBAND())
                    {
                        X_BAND_TRNSM_GET_SimpleReport_struct *SimpleReportData = (X_BAND_TRNSM_GET_SimpleReport_struct *)stackEntry->ESTTC_data;
                        USER_START_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "          System State = %d \r\n", SimpleReportData->SystemState);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           Status Flag = %d \r\n", SimpleReportData->StatusFlag);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "        PA Temperature = %d \r\n", SimpleReportData->PA_Temp);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "              Tx Power = %d \r\n", SimpleReportData->TxPower_m);
                        USER_COMMIT_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                    }
                    else
                    {
                        S_BAND_TRNSM_GET_SimpleReport_struct *SimpleReportData = (S_BAND_TRNSM_GET_SimpleReport_struct *)stackEntry->ESTTC_data;
                        USER_START_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "          System State = %d \r\n", SimpleReportData->SystemState);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           Status Flag = %d \r\n", SimpleReportData->StatusFlag);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "     CPU Temperature = %3.1f \r\n", SimpleReportData->CPU_Temp);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           FW version = %d \r\n", (int)SimpleReportData->FW_Version);
                        USER_COMMIT_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_REP_FULL:
                if (IS_XBAND())
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        X_BAND_TRNSM_GET_FullReport_struct *FullReportData = (X_BAND_TRNSM_GET_FullReport_struct *)stackEntry->ESTTC_data;
                        USER_START_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                  System State         = %d \r\n", FullReportData->SystemState);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                   Status Flag         = %d \r\n", FullReportData->StatusFlag);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                PA Temperature         = %d \r\n", FullReportData->PA_Temp);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                      Tx Power         = %d \r\n", FullReportData->TxPower_m);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "          Predistortion Status         = %d \r\n", FullReportData->PredistortionStat);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           Predistortion Error         = %d \r\n", FullReportData->PredistortionErr);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "         Predistortion Warning         = %d \r\n", FullReportData->PredistortionWarning);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "        Predistortion Frequency Range  = %d \r\n", FullReportData->PredistortionFreqRange);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "        Predistortion Adaptation Mode  = %d \r\n", FullReportData->PredistortionAdaptMode);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "        Predistortion Adaptation State = %d \r\n", FullReportData->PredistortionAdaptState);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           Predistortion Output Status = %d \r\n", FullReportData->PredistortionOutputStat);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "    Predistortion Normalization Factor = %d \r\n", FullReportData->PredistortionNomrFact);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                Predistortion RFIN_AGC = %d \r\n", FullReportData->PredistortionRFIN_AGC);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                Predistortion RFRB_AGC = %d \r\n", FullReportData->PredistortionRFRB_AGC);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "Predistortion Unnormilized Coefficient = %d \r\n", FullReportData->PredistortionUnnormCoeff);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "    Predistortion Internal Temperature = %d \r\n", FullReportData->PredistortionInternTemp);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "  Predistortion Minimum Frequency Scan = %f \r\n", FullReportData->PredisMinFreqScan);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "  Predistortion Maximum Frequency Scan = %f \r\n", FullReportData->PredisMaxFreqScan);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "        Predistortion Signal Bandwidth = %f \r\n", FullReportData->PredisSignalBandwidth);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "       Predistortion Central Frequency = %f \r\n", FullReportData->PredisCentralFreq);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                       CPU Temperature = %f \r\n", FullReportData->CPU_Temperature);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                            FW version = %d \r\n", (int)FullReportData->FW_Version);
                        USER_COMMIT_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Error: Command not supported for SBand module\r\n");
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DIR_LIST:
                if (S_X_BAND_TRNSM_DIR_OK != retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Reading: Error %d \r\n", retRes);
                }
                break;
            default:
                USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err Unknown CMD 0x%X\r\n", (uint8_t)stackEntry->ESTTC_request);
                break;
        }
    }
    else if (stackEntry->ESTTC_request_type == 'W')
    {
        switch (stackEntry->ESTTC_request)
        {
            case S_X_BAND_TRNSM_GW_CMD_ID_SYM_RATE:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Symbol Rate = %d \r\n", stackEntry->ESTTC_data[0]);

