J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
                        // update cached value when the user makes a set request to the module
                        moduleCacheInfo.sym_rate = stackEntry->ESTTC_data[0];
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_TX_PWR:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Tx Power = %d \r\n", stackEntry->ESTTC_data[0]);
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_CENT_FREQ:
                if (stackEntry->ESTTC_data_size == sizeof(float))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Central Frequency = %4.3f \r\n", *((float *)stackEntry->ESTTC_data));
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_MODCOD:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "MODCOD = %d \r\n", stackEntry->ESTTC_data[0]);

                        // update cached value when the user makes a set request to the module
                        moduleCacheInfo.modcod = stackEntry->ESTTC_data[0];
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ROLL_OFF:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Roll-Off = %d \r\n", stackEntry->ESTTC_data[0]);
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PILOT:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Pilot Signal = %d \r\n", stackEntry->ESTTC_data[0]);
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_FEC_FR_SZ:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "FEC Frame size = %d \r\n", stackEntry->ESTTC_data[0]);
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_PRETX_DELAY:
                if (stackEntry->ESTTC_data_size == sizeof(uint16_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Pretransmission Staf Delay = %d \r\n", *((uint16_t *)stackEntry->ESTTC_data));
                        moduleCacheInfo.pretx_delay_ms = *((uint16_t *)(stackEntry->ESTTC_data));
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_ALL_PARAMS:
                if (stackEntry->ESTTC_data_size == sizeof(S_X_BAND_TRNSM_GET_AllParams_struct))
                {
                    S_X_BAND_TRNSM_GET_AllParams_struct AllParamsData;
                    memcpy(&AllParamsData, stackEntry->ESTTC_data, sizeof(S_X_BAND_TRNSM_GET_AllParams_struct));
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_START_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "           Symbol Rate = %d \r\n", AllParamsData.SymbolRate);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "              Tx Power = %d \r\n", AllParamsData.TxPower);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "                MODCOD = %d \r\n", AllParamsData.MODCOD);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "              Roll Off = %d \r\n", AllParamsData.RollOff);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "          Pilot Signal = %d \r\n", AllParamsData.PilotSignal);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "   Pre. FEC Frame Size = %d \r\n", AllParamsData.FEC_Frame_Size);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "Pre. Tx Staffing delay = %d \r\n", AllParamsData.PreTxStaffingDelay);
                        USER_APPEND_FORMATTED_BUF(stackEntry->pUserRespCtx, "     Central Frequency = %4.3f \r\n", AllParamsData.CentralFreq);
                        USER_COMMIT_MULTI_BUF_SEQ(stackEntry->pUserRespCtx);

                        // update cached values on set
                        moduleCacheInfo.sym_rate       = AllParamsData.SymbolRate;
                        moduleCacheInfo.modcod         = AllParamsData.MODCOD;
                        moduleCacheInfo.pretx_delay_ms = AllParamsData.PreTxStaffingDelay;

                        moduleCacheInfo.settings_cache_valid = true;
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_BAUD_RATE:
                if (stackEntry->ESTTC_data_size == sizeof(uint8_t))
                {
                    if (S_X_BAND_TRNSM_PARAMS_OK == retRes)
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Baud rate = %d \r\n", stackEntry->ESTTC_data[0]);
                    }
                    else
                    {
                        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                    }
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err - Size %d\r\n", stackEntry->ESTTC_data_size);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_TX_MODE:
                if (S_X_BAND_TRNSM_CHANG_MODE_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Tx mode started \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_IDLE_MODE:
                if (S_X_BAND_TRNSM_CHANG_MODE_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Load mode started \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_SAFE_SHUTDOWN:
                if (S_X_BAND_TRNSM_CHANG_MODE_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Ready to Shut Down \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_FW_UPDATE:
                if (S_X_BAND_TRNSM_CHANG_MODE_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "FW Updated using  '%s' \r\n", (char *)stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DEL_FILE:
                if (S_X_BAND_TRNSM_DELL_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "File '%s' deleted \r\n", (char *)stackEntry->ESTTC_data);
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DEL_ALL:
                if (S_X_BAND_TRNSM_DELL_OK == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "All files deleted \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Set Parameter: Error %d \r\n", stackEntry->response);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_UPLOAD_FILE: // Copy a file from the OBC to the X-Band
                if (0x00 == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "File '%s' Uploaded\r\n", (char *)stackEntry->ESTTC_data);
                }
                else if (S_X_BAND_TRNSM_STAT_WRONG_PARAM == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Copy Err - Parameter/File name \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Copy Err %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_DOWNLOAD_FILE: // Copy a file from X-Band to the OBC
                if (0x00 == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "File '%s' Downloaded\r\n", (char *)stackEntry->ESTTC_data);
                }
                else if (S_X_BAND_TRNSM_STAT_WRONG_PARAM == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Copy Err - Parameter/File name \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Copy Err %d \r\n", retRes);
                }
                break;
            case S_X_BAND_TRNSM_GW_CMD_ID_SEND_FILES: // Start transmitting files over radio
                if (0x00 == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "File '%s' Sent\r\n", (char *)stackEntry->ESTTC_data);
                }
                else if (S_X_BAND_TRNSM_STAT_WRONG_PARAM == retRes)
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Sending Err - Parameter/File name \r\n");
                }
                else
                {
                    USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Sending Err %d \r\n", retRes);
                }
                break;
            default:
                USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Err Unknown CMD 0x%X\r\n", (uint8_t)stackEntry->ESTTC_request);
                break;
        }
    }
    else
    {
        USER_COMMIT_FORMATTED_BUF(stackEntry->pUserRespCtx, "Unknown request type '%c' \r\n", stackEntry->ESTTC_request_type);
    }
    stackEntry->state        = S_X_BAND_TRNSM_CMD_STATE_EMPTY;
    stackEntry->pUserRespCtx = NULL;
    if (XSBandStack_Slave.parentEntry == stackEntry)
    {
        sx_band_init_stack(&XSBandStack_Slave);
    }
}

/*!
*********************************************************************************************
* @brief Change the mode of the RS485
*********************************************************************************************
* @param[input]      state:
*                       1 - Transmit
*                       0 - Receive
* @param[output]     none
* @return            none
* @note              none
*********************************************************************************************
*/
static void S_X_BAND_TRNSM_Rx_Tx_State(uint8_t state)
{
    if (state == 0)
    {
        /* Receive mode */
        HAL_GPIO_WritePin(SX_BAND_TxEnbl_GPIO_Port, SX_BAND_TxEnblPin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(U3_RS485_S1_nRE_GPIO_Port, U3_RS485_S1_nRE_Pin, GPIO_PIN_RESET);
    }
    else
    {
        /* Transmit mode */
        HAL_GPIO_WritePin(SX_BAND_TxEnbl_GPIO_Port, SX_BAND_TxEnblPin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(U3_RS485_S1_nRE_GPIO_Port, U3_RS485_S1_nRE_Pin, GPIO_PIN_SET);
    }

