J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
    osDelay(1);
}

/*!
*********************************************************************************************
* @brief Transmit Acknowledge packet after response of a successful command
*********************************************************************************************
* @param[input]      Identifier - ID of the used S or X band transmitter
* @param[input]      CMD - command number from enumeration X_BAND_TRNSM_CMD_enum, that was already transmitted
* @param[input]      CMD_Type - Some commands have different types, the rest don't have. Use values as follow:
*                       + X_BAND_TRNSM_NULL_TYPE - for commands without type
*                       + value form X_BAND_TRNSM_GET_types_enum - for Command GET (X_BAND_TRNSM_CMD_GET)
*                       + value from X_BAND_TRNSM_SET_types_enum - for Command SET (X_BAND_TRNSM_CMD_SET)
*                       + value from X_BAND_TRNSM_SendFile_types_enum - for Command SEND FILE (X_BAND_TRNSM_CMD_SEND_F)
*                       + value from X_BAND_TRNSM_SendFile_types_enum - for Command SEND FILE (X_BAND_TRNSM_CMD_SEND_F)
* @param[output]     none
* @return            none
* @note              none
*********************************************************************************************
*/
static void S_X_BAND_TRNSM_Send_Ack(uint16_t Identifier, S_X_BAND_TRNSM_CMD_enum CMD, uint16_t CMD_Type)
{
    uint32_t                    TxPackCRC    = 0;
    S_X_BAND_TRNSM_Pack_struct *TxPackStruct = (S_X_BAND_TRNSM_Pack_struct *)TxDataBuffer;

    TxPackStruct->Header   = S_X_BAND_TRNSM_HEADER;
    TxPackStruct->ModuleID = Identifier;
    TxPackStruct->Length   = 0;
    TxPackStruct->Response = S_X_BAND_TRNSM_STAT_ACK;
    TxPackStruct->CMD      = (uint16_t)TxCMD_Descriptor[CMD].CMD;
    TxPackStruct->Type     = CMD_Type;

    /* copy the structure of the packet to the transmit buffer */
    TxPackCRC = crc32(0, (BYTE *)TxPackStruct, S_X_BAND_TRNSM_STRCT_SIZE);

    // Clear the extra bytes that will be set after the packet to complete to divisible to 16
    memset(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + sizeof(TxPackCRC)], 0, ((((S_X_BAND_TRNSM_STRCT_SIZE + sizeof(TxPackCRC)) >> 4) + 1) << 4) - (S_X_BAND_TRNSM_STRCT_SIZE + sizeof(TxPackCRC)));

    /* copy the CRC to the transmit buffer after the structure of the packet */
    memcpy(&TxDataBuffer[S_X_BAND_TRNSM_STRCT_SIZE + TxPackStruct->Length], &TxPackCRC, sizeof(TxPackCRC));

    S_X_BAND_TRNSM_Rx_Tx_State(1);

    (void)HAL_UART_Transmit_DMA(p_sx_band_uart_hnd, TxDataBuffer, (((S_X_BAND_TRNSM_STRCT_SIZE + sizeof(TxPackCRC)) >> 4) + 1) << 4);
}

/*!
*********************************************************************************************
* @brief Writes all settings of the S-Band transmitter (without the baud-rate)
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_SetGetParams_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_CMD_SET_Param(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;

    // Check for baudrate
    if (stackEntry->type == S_X_BAND_TRNSM_SET_TYPE_BAUDRATE)
    {
        return S_X_BAND_TRNSM_CMD_SET_Param_Baudrate(stackEntry);
    }
    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, stackEntry->ESTTC_data, stackEntry->ESTTC_data_size);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }
            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Verify the answer
                if (sizeof(retStat) == RxDataLength)
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if ((retStat == S_X_BAND_TRNSM_PARAMS_OK) || (retStat == S_X_BAND_TRNSM_PARAMS_PARAMS_ERR))
                    {
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
#if S_X_BAND_STACK_DELAY
                else
                {
                    ES_TRACE_DEBUG("X_BAND_TRNSM_CMD_SET_Param GETRESULT error %d\r\n", (int)retStat);
                }
#endif
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Reads one settings of the S-Band transmitter (without the baud-rate)
*********************************************************************************************
* @param[input]      stackEntry - current stack entry
* @param[output]     none
* @return            retStat - a value from enumeration X_BAND_TRNSM_SetGetParams_enum
* @note              none
*********************************************************************************************
*/
static uint8_t S_X_BAND_TRNSM_CMD_GET_Param(S_X_BAND_CMD_StackEntry *stackEntry)
{
    uint8_t  retStat = 0x00;
    uint16_t RxDataLength;
    uint32_t expectedSize = 0;

    // Check for available retries
    if (stackEntry->retries <= 0)
    {
        if (stackEntry->state != S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED)
        {
            retStat = S_X_BAND_TRNSM_PARAMS_COMM_ERR;
        }
        return retStat;
    }
    // Check for command state
    switch (stackEntry->state)
    {
        case S_X_BAND_TRNSM_CMD_STATE_CMD:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_RES:
            // Send command
            retStat = S_X_BAND_TRNSM_SendCMD(stackEntry->devID, stackEntry->command, stackEntry->type, 0, 0);
            if (S_X_BAND_TRNSM_STAT_ACK == retStat)
            {
                stackEntry->state     = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT;
                stackEntry->timestamp = xTaskGetTickCount();
            }
            else
            {
                // Failed to send the command
                stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_RES;
                if ((S_X_BAND_TRNSM_STAT_COMM_ERR == retStat) && (!S_X_BAND_TRNSM_Scan_Baud_Rates(stackEntry->devID)))
                {
                    stackEntry->retries = 0;
                    break;
                }

                S_X_BAND_STACK_RETR_SUB(retStat != S_X_BAND_TRNSM_STAT_ACK && retStat != S_X_BAND_TRNSM_STAT_GET_RESULT, stackEntry);
            }
            retStat = 0x00;
            break;
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT:
        case S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES:
            // Check whether the protocol delay has passed
            if (stackEntry->minDelay > (xTaskGetTickCount() - stackEntry->timestamp))
            {
                break;
            }

            stackEntry->timestamp = xTaskGetTickCount();
            // Send GetResult command
            retStat = S_X_BAND_TRNSM_GetResult(stackEntry->devID, stackEntry->command, stackEntry->type, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);
            // Update the state
            stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_GETRESULT_RES;
            if (S_X_BAND_TRNSM_STAT_GET_RESULT == retStat)
            {
                // Identify the expected size
                switch (stackEntry->type)
                {
                    case S_X_BAND_TRNSM_GET_TYPE_SIMPLE_REPORT:
                        if (IS_XBAND())
                        {
                            expectedSize = sizeof(X_BAND_TRNSM_GET_SimpleReport_struct);
                        }
                        else
                        {
                            expectedSize = sizeof(S_BAND_TRNSM_GET_SimpleReport_struct);
                        }
                        break;
                    case X_BAND_TRNSM_GET_TYPE_FULL_REPORT:
                        expectedSize = sizeof(X_BAND_TRNSM_GET_FullReport_struct);
                        break;

                    default:
                        expectedSize = sizeof(S_X_BAND_TRNSM_GET_AllParams_struct);
                        break;
                }

                // Verify the answer
                ++expectedSize;

                if ((expectedSize >= RxDataLength) && (RxDataLength > 0))
                {
                    // Get the status of the request
                    retStat = S_X_BAND_TRNSM_Result_Rx_Buffer[0];
                    // If the status is "OK"
                    if (retStat == S_X_BAND_TRNSM_PARAMS_OK)
                    {
                        // Update the state
                        stackEntry->state = S_X_BAND_TRNSM_CMD_STATE_CMD_FINISHED;
                        // Copy the data
                        stackEntry->ESTTC_data_size = RxDataLength - 1;
                        memcpy(stackEntry->ESTTC_data, &S_X_BAND_TRNSM_Result_Rx_Buffer[1], stackEntry->ESTTC_data_size);
                        break;
                    }
                }
            }
            else
            {
                // Failed to send the command
                if (S_X_BAND_STACK_RETR_COND(retStat))
                {
                    retStat = 0x00;
                }
#if S_X_BAND_STACK_DELAY
                else
                {
                    ES_TRACE_DEBUG("X_BAND_TRNSM_CMD_GET_Param GETRESULT error %d\r\n", (int)retStat);
                }
#endif
            }
            // Subtract the retry count
            DECR_IF_NONZERO(stackEntry->retries);
            break;
        default:
            break;
    }

    return retStat;
}

/*!
*********************************************************************************************
* @brief Check for successful communication at all available baudrates
*********************************************************************************************
* @param[input]      Identifier - ID of the used S or X band transmitter
* @param[output]     none
* @return            true - done, false - failed to establish communication
* @note              none
*********************************************************************************************
*/
static bool S_X_BAND_TRNSM_Scan_Baud_Rates(uint16_t Identifier)
{
    bool comm_success = false;

