J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
    for (uint8_t Baudrate = 0U; Baudrate < CDEF_ELEMENT_COUNT(BaudRateArray); Baudrate++)
    {
        S_X_BAND_TRNSM_S_Current_Baudrate = Baudrate;
        S_X_BAND_LastExecCmd_Tick         = 0U;

        // reinitialize UART with a different baud-rate
        sx_band_init(INIT_HW);

        S_X_BAND_TRNSM_Response_enum cmd_stat = S_X_BAND_TRNSM_SendCMD(Identifier, S_X_BAND_TRNSM_CMD_GET, S_X_BAND_TRNSM_GET_TYPE_SYMBOL_RATE, 0, 0);

        if (S_X_BAND_TRNSM_STAT_ACK == cmd_stat)
        {
            uint16_t RxDataLength;
            // just obtain the result of the command to clean it up from the X-band Transmitter stack
            (void)S_X_BAND_TRNSM_GetResult(Identifier, S_X_BAND_TRNSM_CMD_GET, S_X_BAND_TRNSM_GET_TYPE_SYMBOL_RATE, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);

            comm_success = true;
            break;
        }
    }

    if (!comm_success)
    {
        S_X_BAND_TRNSM_S_Current_Baudrate = S_X_BAND_TRNSM_DEFAULT_BAUDRATE;
        sx_band_init(INIT_HW);
        EXEH_vException(eEXEHSeverity_Error, eEXEHModuleID_S_X_BAND, eEXEH_S_X_BAND_EXCEPTION_ID_AUTO_BAUD_RATE_NOT_FOUND, __LINE__);
    }

    return comm_success;
}

/*!
*********************************************************************************************
* @brief The function probes the radio module with the `Simple Report` command to determine
*         the correct type of device connected to the OBC. The returned response differs in
*         size between the S- and X-Band modules.
*********************************************************************************************
*/
static void S_X_BAND_TRNSM_Detect_Band_Type(const uint16_t Identifier)
{
    // one time detection is performed after SXBand subsystem init
    if (S_X_BAND_TRNSM_DEVTYPE_UNKNOWN == XSBandDevType)
    {
        S_X_BAND_TRNSM_Response_enum cmd_stat = S_X_BAND_TRNSM_SendCMD(Identifier, S_X_BAND_TRNSM_CMD_GET, S_X_BAND_TRNSM_GET_TYPE_SIMPLE_REPORT, (uint8_t *)NULL, 0);

        // command was confirmed by the device and CRC checks passed
        if (S_X_BAND_TRNSM_STAT_ACK == cmd_stat)
        {
            uint16_t RxDataLength;

            (void)S_X_BAND_TRNSM_GetResult(Identifier, S_X_BAND_TRNSM_CMD_GET, S_X_BAND_TRNSM_GET_TYPE_SIMPLE_REPORT, S_X_BAND_TRNSM_Result_Rx_Buffer, &RxDataLength);

            switch (RxDataLength)
            {
                case sizeof(X_BAND_TRNSM_GET_SimpleReport_struct) + 1U:
                    XSBandDevType = S_X_BAND_TRNSM_DEVTYPE_XBAND;
                    break;

                case sizeof(S_BAND_TRNSM_GET_SimpleReport_struct) + 1U:
                    XSBandDevType = S_X_BAND_TRNSM_DEVTYPE_SBAND;
                    break;

                default:
                    // assume we have an XBand just to avoid forcing detection on each subsequent command
                    XSBandDevType = S_X_BAND_TRNSM_DEVTYPE_XBAND;
                    break;
            }
        }

        // no else clause because this means that the command could not be sent and we should try
        // again next time
    }
}

/*!
*********************************************************************************************
* @brief The function provides a worst-case estimate of the time to wait for a command to
*        finish execution.
*
* The calculated ETA can be used to schedule command execution in series without prematurely
* timing out.
*
* @param[in[ Id Module identifier (not relevant for the timeout estimation but needed for
*               certain commands to collect settings from the module before estimating the
*               time to wait)
* @param[in] Cmd command identifier
* @param[in] Type command type (ASCII 'R'ead or 'W'rite)
* @param[in] size Data size in bytes
* @param[in] pData command data (used for certain commands such as 'Send files' to be able to
*                  estimate the size of all files requested)
* @return worst-case timeout for the specified command in milliseconds
*********************************************************************************************
*/
static uint32_t S_X_Band_Get_Cmd_Timeout(uint16_t Identifier, S_X_BAND_TRNSM_GW_CMD_ID_enum Cmd, uint8_t Type, uint8_t size, const uint8_t *pData)
{
    double timeout_ms = CMD_AVG_TIMEOUT_MS;

    switch (Cmd)
    {
        case S_X_BAND_TRNSM_GW_CMD_ID_UPLOAD_FILE:
            {
                uint32_t            fsize = 0U;
                fm_fast_file_info_t tfi;

                fm_result_t fres = fm_stat((const char *)pData, &tfi);

                fsize = (FM_RES_OK == fres) ? tfi.size : 0;

                if (0U == fsize)
                {
                    timeout_ms = FILE_CMD_TIMEOUT_MIN_MS;
                }
                else
                {
                    timeout_ms = (1000. * fsize) / WORST_BYTES_PER_SEC_RATE;

                    // put minimum timeout to ensure that waiting will not finish before the SXBand driver has a chance to
                    // activate its task to attempt communication
                    if (timeout_ms < FILE_CMD_TIMEOUT_MIN_MS)
                    {
                        timeout_ms = FILE_CMD_TIMEOUT_MIN_MS;
                    }
                }

                break;
            }

        case S_X_BAND_TRNSM_GW_CMD_ID_DOWNLOAD_FILE:
            {
                uint64_t downloadSizeBytes = S_X_Band_Get_File_Size_From_Cache((const char *const)pData);

                timeout_ms = (1000. * downloadSizeBytes) / WORST_BYTES_PER_SEC_RATE;

                break;
            }

        case S_X_BAND_TRNSM_GW_CMD_ID_SEND_FILES:
            {
                if ((moduleCacheInfo.settings_cache_valid) &&
                    (moduleCacheInfo.file_cache_valid) &&
                    (moduleCacheInfo.modcod < CDEF_ELEMENT_COUNT(ModCod_BitRate_Coeffs) - 1) &&
                    (moduleCacheInfo.sym_rate != INVALID_SETTING_VALUE_1B))
                {
                    uint64_t downloadSizeBytes = S_X_Band_Get_File_Size_From_Cache((const char *const)pData);

