J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
                    // refer to SXBand User's Manual for calculation details
                    // (S-Band Transmitter rev. 2.15 / page 76)
                    // (X-Band Transmitter rev. 2.15 / page 76)
                    double max_bits_per_sec = (moduleCacheInfo.sym_rate * 1e6) * ModCod_BitRate_Coeffs[moduleCacheInfo.modcod];

                    // decrease bit rate estimation with the transmission-specfic overhead
                    max_bits_per_sec -= ((max_bits_per_sec * TRNSM_ENC_OVERHEAD_PERCENTAGE) / 100.);

                    timeout_ms = (BITS_IN_1_BYTE * 1000. * downloadSizeBytes) / max_bits_per_sec;
                }
                else
                {
                    // the timeout calculation cannot be performed due to invalid cache
                    timeout_ms = TX_CMD_TIMEOUT_MS;
                }

                break;
            }

        case S_X_BAND_TRNSM_GW_CMD_ID_TX_MODE:
            {
                timeout_ms = TX_CMD_TIMEOUT_MS;

                // if the pretransmission delay value is cached, also add it here just in case
                if ((moduleCacheInfo.settings_cache_valid) &&
                    (moduleCacheInfo.pretx_delay_ms != INVALID_SETTING_VALUE_2B))
                {
                    timeout_ms += moduleCacheInfo.pretx_delay_ms;
                }

                break;
            }

        case S_X_BAND_TRNSM_GW_CMD_ID_DEL_FILE:
        case S_X_BAND_TRNSM_GW_CMD_ID_DEL_ALL:
            {
                timeout_ms = DEL_CMD_TIMEOUT_MS;
                break;
            }

        case S_X_BAND_TRNSM_GW_CMD_ID_SYM_RATE:
        case S_X_BAND_TRNSM_GW_CMD_ID_TX_PWR:
        case S_X_BAND_TRNSM_GW_CMD_ID_CENT_FREQ:
        case S_X_BAND_TRNSM_GW_CMD_ID_MODCOD:
        case S_X_BAND_TRNSM_GW_CMD_ID_ROLL_OFF:
        case S_X_BAND_TRNSM_GW_CMD_ID_PILOT:
        case S_X_BAND_TRNSM_GW_CMD_ID_FEC_FR_SZ:
        case S_X_BAND_TRNSM_GW_CMD_ID_PRETX_DELAY:
        case S_X_BAND_TRNSM_GW_CMD_ID_ALL_PARAMS:
        case S_X_BAND_TRNSM_GW_CMD_ID_REP_SIMPLE:
        case S_X_BAND_TRNSM_GW_CMD_ID_REP_FULL:
        case S_X_BAND_TRNSM_GW_CMD_ID_BAUD_RATE:
        case S_X_BAND_TRNSM_GW_CMD_ID_IDLE_MODE:
        case S_X_BAND_TRNSM_GW_CMD_ID_SAFE_SHUTDOWN:
        case S_X_BAND_TRNSM_GW_CMD_ID_FW_UPDATE:
        case S_X_BAND_TRNSM_GW_CMD_ID_DIR_LIST:
        case S_X_BAND_TRNSM_GW_CMD_ID_MAX:
        default:
            {
                break;
            }
    }

    // assuming the command sender thread blocks for the calculated timeout value here, if the value is
    // too small, the caller may unblock its thread and decide there is a buffer timeout prematurely as
    // the SXBand response buffer needs several task executions to be filled completely and sent back
    // (this average worst case timeout guard is here to avoid such situations)
    if (((uint32_t)timeout_ms) < CMD_AVG_TIMEOUT_MS)
    {
        timeout_ms = CMD_AVG_TIMEOUT_MS;
    }

    ES_TRACE_DEBUG("cmd 0x%04x | type: %c | sz = %lu == timeout (ms) ==> %lu\r\n", Cmd, (char)Type, size, (uint32_t)timeout_ms);

    return (uint32_t)timeout_ms;
}

/** @brief Called when a new dir list command is triggered for execution */
static void S_X_Band_On_Dir_List_Start(void)
{
    moduleCacheInfo.file_cache_valid = false;

    (void)fm_close(&moduleCacheInfo.fhnd);
    (void)fm_open(&moduleCacheInfo.fhnd, SX_BAND_FILECACHE_NAME, FM_MODE_CREATE_ALWAYS | FM_MODE_WRITE);
}

/** @brief Called when new file data is enumerated by the Dir List command
 *  @param[in] pFileInfo a pointer to the file info structure as reported by the SXBand module
 */
static void S_X_Band_On_Enumerate_File(const S_X_BAND_TRNSM_FileInfo_struct *const pFileInfo)
{
    if (moduleCacheInfo.in_progress)
    {
        uint32_t    bytes_written = 0U;
        fm_result_t fres          = fm_write(&moduleCacheInfo.fhnd, pFileInfo, sizeof(S_X_BAND_TRNSM_FileInfo_struct), &bytes_written);

        if ((FM_RES_OK == fres) && (bytes_written == sizeof(S_X_BAND_TRNSM_FileInfo_struct)))
        {
            ES_TRACE_DEBUG("== SXB CACHE UPDATE ===> %s | size = %lu\r\n", pFileInfo->FileName, pFileInfo->Size);
            moduleCacheInfo.file_cache_valid = true;
        }
        else
        {
            moduleCacheInfo.file_cache_valid = false;
        }
    }
}

/** @brief Called when the dir list operation finished and there are no more files to report via
 *         @ref S_X_Band_On_Enumerate_File()
 */
static void S_X_Band_On_Dir_List_Finished(void)
{
    (void)fm_close(&moduleCacheInfo.fhnd);
}

/** @brief Scans the existing SXBand SD card file cache for one or more files and
 *         calculates their total size.
 *
 *  The function is used for worst-case timeout calculations when scheduling SXBand
 *  file transfer commands.
 *
 *  @param[in] pFilePattern a single file name or a valid SXBand file pattern which can
 *                          be used with the SendFiles command (only asterisk '*' symbol is supported)
 *  @return size in bytes of all files matching the pattern specified
 */
static uint64_t S_X_Band_Get_File_Size_From_Cache(const char *const pFilePattern)
{
    uint64_t      totalSize = 0LL;
    fm_file_obj_t fhnd;
    uint32_t      bytes_read = 0U;

    fm_result_t fres = fm_open(&fhnd, SX_BAND_FILECACHE_NAME, FM_MODE_OPEN_EXISTING | FM_MODE_READ);

    if (FM_RES_OK == fres)
    {
        S_X_BAND_TRNSM_FileInfo_struct finfo_entry;

        fres = fm_read(&fhnd, &finfo_entry, sizeof(finfo_entry), &bytes_read);

        while (bytes_read > 0)
        {
            if ((FM_RES_OK == fres) && (bytes_read == sizeof(finfo_entry)))
            {
                if ((finfo_entry.NameLength > 0) &&
                    (file_helper_is_wc_matching(pFilePattern,
                                                strlen(pFilePattern),
                                                (const char *const)finfo_entry.FileName,
                                                finfo_entry.NameLength - 1)))
                {
                    totalSize += finfo_entry.Size;

