J-hsu-j/OBC/OBC_STDPF/espf/arch/stm32h753iit/drivers/radio/es_sxband/S_X_Band_Trnsm.c
                    // if this is not a pattern string and we already found a match, there is no need to go on
                    // with checking
                    if (NULL == strstr(pFilePattern, "*"))
                    {
                        break;
                    }
                }
            }

            fres = fm_read(&fhnd, &finfo_entry, sizeof(finfo_entry), &bytes_read);
        }
    }

    fm_close(&fhnd);

    return totalSize;
}

/** @brief Initialize an SXBand stack entry in memory
 *
 *  @param[out] p_stack_entry a pointer to the entry to be initialized
 *
 */
static void sx_band_init_stack(S_X_BAND_CMD_StackEntry *const p_stack_entry)
{
    CRIT_ASSERT(NULL != p_stack_entry);

    p_stack_entry->devID              = 0x0000;
    p_stack_entry->state              = S_X_BAND_TRNSM_CMD_STATE_EMPTY;
    p_stack_entry->ESTTC_request      = S_X_BAND_TRNSM_GW_CMD_ID_MAX;
    p_stack_entry->ESTTC_request_type = '\0';
    p_stack_entry->ESTTC_data_size    = 0;
    (void)memset(p_stack_entry->ESTTC_data, 0, sizeof(p_stack_entry->ESTTC_data));
    p_stack_entry->command            = S_X_BAND_TRNSM_CMD_NUMBER;
    p_stack_entry->isFileCommand      = false;
    p_stack_entry->type               = 0;
    p_stack_entry->response           = S_X_BAND_TRNSM_STAT_NUMBER;
    p_stack_entry->result             = S_X_BAND_TRNSM_RET_RES_NUMBER;
    p_stack_entry->fileHandler        = (uint32_t)-1;
    p_stack_entry->fileSize           = 0;
    p_stack_entry->timestamp          = 0;
    p_stack_entry->minDelay           = 0;
    p_stack_entry->retries            = 0;
    p_stack_entry->expectSlaveCommand = 0;
    p_stack_entry->pUserRespCtx       = NULL;
    p_stack_entry->parentEntry        = NULL;
}

/*!
*********************************************************************************************
* @brief Transfers the received SXBand data from the DMA buffer to the local data buffer
*          using a given DMA buffer offset
*********************************************************************************************
* @param[input]      offset - byte offset to use when copying data from the DMA buffer
* @return            none
*********************************************************************************************
*/
static void Transfer_Rx_Data_From_Offset(const uint32_t offset)
{
    memcpy(&(S_X_BAND_TRNSM_X_Band_Data[S_X_Band_Index * S_X_BAND_PACK_SIZE]), &S_X_BAND_DMA_Buffer[offset], S_X_BAND_PACK_SIZE);
    S_X_Band_Index++;

    uint32_t data_size  = 18 + S_X_BAND_TRNSM_X_Band_Data[6] + S_X_BAND_TRNSM_X_Band_Data[7] * 256L;
    uint32_t pack_count = ((data_size % 16) == 0) ? (data_size / 16) : ((data_size / 16) + 1);
    if (S_X_Band_Index >= pack_count)
    {
        osThreadFlagsSet(S_X_BAND_Task_TaskHandle, S_X_BAND_TASK_DMA_FLAG);
    }
}

void S_X_BAND_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;

    Transfer_Rx_Data_From_Offset(0U);
}

void S_X_BAND_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;

    Transfer_Rx_Data_From_Offset(S_X_BAND_PACK_SIZE);
}

void S_X_BAND_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;

    S_X_BAND_TRNSM_Rx_Tx_State(0);
}

void S_X_BAND_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    (void)huart;

    S_X_BAND_TRNSM_Rx_Tx_State(0);
}

/* ******************************************************************************************* */
